Repository: dvoropaev/alterator-for-doc
Catalog: subprojects/alteratorctl/po/alteratorctl.po
Languages: ru

source: Failed to set environment variable ("%s": "%s") for getting diagnostic tests of service "%s".
ru: Не удалось установить переменную окружения ("%s": "%s") для получения диагностических тестов сервиса "%s".

source: Failed to get diagnostic tests of unspecified diagnostic tool.
ru: Не удалось получить диагностические тесты неуказанного диагностического инструмента.

source: Empty info of diagnostic tests of "%s" diagnostic tool.
ru: Отсутствует информация о тестах диагностического инструмента "%s"

source: Failed to get "%s" diagnostic tool tests of "%s" service. Empty result.
ru: Не удалось получить тесты диагностического инструмента "%s" сервиса "%s".

source: Failed to get diagnostic tests of "%s" service. Empty result.
ru: Не удалось получить диагностические тесты сервиса "%s".

source: Can't get diagnostic test of unspecified diagnostic tool.
ru: Невозможно получить тесты неуказанного диагностического инструмента.

source: Can't get "%s" diagnostic tool tests of "%s" service. The services module doesn't exist.
ru: Невозможно получить тесты диагностического инструмента "%s" сервиса "%s". Модуль services не существует.

source: Can't get "%s" diagnostic tool tests of "%s" service. Incorrect bus type.
ru: Невозможно получить список тестов диагностического инструмента "%s" сервиса "%s". Некорректный тип шины.

source: Can't get diagnostic tests of unknown service. Incorrect bus type.
ru: Невозможно получить тесты неуказанного сервиса. Некорректный тип шины.

source: Can't get "%s" diagnostic tool tests of "%s" service. There is nowhere to save the result.
ru: Невозможно получить тесты диагностического инструмента "%s" сервиса "%s". Некуда сохранить результат.

source: Failed to unset environment variable "%s" for getting diagnostic tests of service "%s".
ru: Не удалось сбросить переменную окружения "%s" для получения диагностических тестов сервиса "%s".

source: Can't get diagnostics tests info of unspecified service.
ru: Невозможно получить список диагностических тестов неуказанного сервиса.

source: Can't get diagnostics tests of "%s" service.
ru: Невозможно получить список тестов инструмента %s

source: Failed to get all service "%s" tools info. Error getting service alterator entry info.
ru: Не удалось получить информацию о всех диагностических инструментах сервиса "%s". Не удалось получить информацию о сервисе.

source: Failed to get all service "%s" tools info. No diagnostics tools.
ru: Не удалось получить информацию о всех диагностических инструментах сервиса "%s". Нет диагностических инструментов.

source: Failed to get all service "%s" tools info. Tool "%s" doesn't exists.
ru: Не удалось получить информацию о всех диагностических инструментах сервиса "%s". Инстркумент "%s" не существует.

source: Failed to get all service "%s" tools info. The "%s" tool bus isn't specified.
ru: Не удалось получить информацию о всех диагностических инструментах сервиса "%s". Не указана D-Bus шина диагностического инструмента "%s".

source: Failed to get all service "%s" tools info. The "%s" tool path isn't specified.
ru: Не удалось получить информацию о всех диагностических инструментах сервиса "%s". Не указана путь D-Bus объекта диагностического инструмента "%s".

source: Can't get diagnostics tests info of "%s" service with unspecified diagnostic tool.
ru: Не удалось получить информацию о тестах неуказанного диагностического инструмента сервиса "%s".

source: Can't get "%s" diagnostic tool info of "%s" service. Invalid bus type.
ru: Невозможно получить "%s" диагностический инструмент сервиса "%s". Некорректный тип шины D-Bus.

source: Can't save "%s" diagnostic tool info of "%s" service.
ru: Невозможно сохранить информацию о диагностическом инструменте "%s" сервиса "%s".

source: Failed to run getting diagnostic tests info in "%s" service.
ru: Не удалось начать получение информации о диагностических тестах сервиса"%s".

source: Can't get dbus source.
ru: Невозможно получить GDBusSource.

source: WARNING: Diagnostic tool "%s" in service "%s" cannot be used - D-Bus object "%s" not found.
ru: ПРЕДУПРЕЖДЕНИЕ: Диагностический инструмент "%s" сервиса "%s" не может быть использован - D-Bus объект "%s" не найден.

source: Can't run diagnostics tests of unspecified service.
ru: Невозможно запустить диагностические тесты неуказанного сервиса.

source: Can't run diagnostics tests of %s service with unspecified diagnostic tool.
ru: Невозможно запустить диагностические тесты сервиса "%s" с неуказанныи диагностическим инструментом.

source: Can't run unspecified diagnostics test of %s service.
ru: Невозможно запустить неуказанные диагностические тесты сервиса "%s".

source: Can't run unspecified diagnostics test of %s diagnostic tool of %s service.
ru: Невозможно запустить неуказанные диагностические тесты инструмента "%s" сервиса "%s".

source: Can't run diagnostics tests of %s service.
ru: Невозможно запустить диагностические тесты "%s" сервиса.

source: Failed to run diagnostics tests. Unknown diagnostic tool bus type in %s service.
ru: Не удалось запустить диагностические тесты. Неизвестный тип шины инструмента сервиса "%s".

source: Failed to run diagnostics tests. Unknown %s diagnostic tool bus type in %s service.
ru: Не удалось запустить диагностические тесты. Неизвестный тип шины инструмента "%s" сервиса "%s".

source: Can't get resource %s value of unspecified service.
ru: Невозможно получить значение ресурса "%s" неуказанного сервиса.

source: Can't get unspecified resource value of %s service.
ru: Невозможно получить значение ресурса сервиса "%s".

source: Can't get %s resource value of %s service: no resources data.
ru: Невозможно получить значение ресурса "%s", принадлежащее сервису "%s": нет данных о ресурсе.

source: No container for saving resource %s value of %s service.
ru: Не передан контейнер для сохранение значения ресурса "%s", принадлежащего сервису "%s".

source: Unknown resourse %s value type in %s service.
ru: Неизвестный тип данных значения ресурса "%s", принадлежащего сервису "%s".

source: Invalid resource %s value type as a empty array in %s service.
ru: Недопустимый тип значения ресурса "%s" - пустой массив в сервисе "%s".

source: Unsupported resourse %s value type as a composite param in %s service.
ru: Неподдерживаемый тип значения ресурса "%s" как составного параметра в сервисе "%s".

source: Can't strignify toml value.
ru: Не удалось стринифицировать значение toml файла.

source: Can't get non-existance value of resource "%s" in "%s" service.
ru: Невозможно получить несуществующее значение ресурса "%s" сервиса "%s".

source: A resource conflict was detected within the "%s" service: it attempts to acquire the same resources "%s" and "%s"
ru: Обнаружен конфликт ресурсов внутри сервиса "%s": сервис пытается занять одинаковые ресурсы "%s" и "%s"

source: A resource conflict was detected within the service "%s": the service it attempts to acquire the same resources:
ru: Обнаружен конфликт ресурсов внутри сервиса "%s": сервис пытается занять одинаковые ресурсы:

source: Internal error: empty service info.
ru: Внутренняя ошибка: отсутствует информация о сервисе.

source: Internal error: failed to check resources conflicts with other services.
ru: Внутренняя ошибка: не удалось проверить конфликты ресурсов с другим сервисом.

source: Internal error: failed to check conflicts with other services.
ru: Внутренняя ошибка: не удалось проверить конфликты ресурсов с другим сервисом.

source: Invalid json parameters.
ru: Некорректные Json параметры.

source: Resource "%s" with value %s is occupied by another service "%s".
ru: Ресурс "%s" со значением %s занят сервисом "%s".

source: Resource conflict detected.
ru: Обнаружен конфликт ресурсов.

source: Resources conflicts detected.
ru: Обнаружены конфликты ресурсов.

source: Can't validate json params in %s service. The services module doesn't exist.
ru: Невозможно проверить параметры в Json сервиса "%s". Модуль services не существует.

source: Can't validate json params. The services module doesn't exist.
ru: Невозможно проверить параметры в Json-формате. Модуль services не существует.

source: Can't validate json params in unspecified service.
ru: Невозможно проверить Json параметры неуказанного сервиса.

source: Can't validate json params in %s service. Parameters is NULL.
ru: Невозможно проверить Json параметры сервиса "%s". Параметры равны NULL.

source: Failed to validate %s service parameters. Can't get service info.
ru: Не удалось проверить параметры сервиса "%s". Не удалось получить информацию о сервисе.

source: It is not possible to validate parameters for a service that does not contain them.
ru: Невозможно проверить параметры сервиса, который их не содержит.

source: Service %s validation parameters failed. The service doesn't have "%s" parameter.
ru: Не удалось проверить параметры сервиса "%s". Сервис не содержит параметр "%s".

source: Service %s validation parameters failed. The parameter %s data type isn't defined in the service alterator entry.
ru: Не удалось проверить параметры сервиса "%s". Тип данных параметра "%s" не определён.

source: Service %s validation parameters failed. Services don't support null parameters.
ru: Не удалось проверить параметры сервиса "%s". Сервис не поддерживает null-параметры.

source: Service %s validation parameters failed. The parameter %s must have an "%s" data type, not a "array".
ru: Не удалось проверить параметры сервиса "%s". Параметр "%s" должен иметь тип данных "%s", не массив.

source: Service %s validation parameters failed. Wrong type of array min length field of "%s" array in %s service alterator entry.
ru: Не удалось проверить параметры сервиса "%s". Некорректный тип данных значения минимальной длины массива "%s" в информации о сервисе "%s".

source: Service %s validation parameters failed. Wrong type of array max length field of "%s" array in %s service alterator entry.
ru: Не удалось проверить параметры сервиса "%s". Некорректный тип данных значения максимальной длины массива "%s" в информации о сервисе "%s".

source: Service %s validation parameters failed. The size of the array parameter "%s" must be greater than %d, while it is %d.
ru: Не удалось проверить параметры сервиса "%s". Длина параметра-массива "%s" должна быть больше %d, сейчас она равна %d.

source: Service %s validation parameters failed. The size of the array parameter "%s" must be less than %d, while it is %d.
ru: Не удалось проверить параметры сервиса "%s". Длина параметра-массива "%s" должна быть меньше %d, сейчас она равна %d.

source: Wrong array %s parameter elem type %s.
ru: Некорректный тип элемента массива "%s" - "%s".

source: Wrong %s parameter type %s.
ru: Некорректный тип параметра "%s": "%s".

source: Service %s validation parameters failed. The parameter %s must have an "%s" data type, not a "object".
ru: Проверка параметров сервиса "%s" провалилась. Параметр %s должен иметь тип данных "%s", а не тип "object".
