Repository: dvoropaev/alterator-for-doc
Catalog: subprojects/alteratorctl/po/alteratorctl.po
Languages: ru

source: Can't allocate dbus_ctx_t in systeminfo_module_get_monitor_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_monitor_subcommand

source: D-Bus error in systeminfo module while calling GetMonitor(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo GetMonitor(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo motherboard".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo motherboard".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_motherboard_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_motherboard_subcommand

source: D-Bus error in systeminfo module while calling GetMotherboard(): failed to produce a result.
ru: Ошибка D-Bus в модуле systeminfo при вызове GetMotherboard(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo locales".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo locales".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_locales_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_locales_subcommand

source: D-Bus error in systeminfo module while calling GetLocales(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo GetLocales(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo desktops".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo desktops".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_desktops_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_desktops_subcommand

source: D-Bus error in systeminfo module while calling ListDesktopEnvironments(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo ListDesktopEnvironments(): невозможно получить результат.

source: Internal error in systeminfo module when handle result: module is NULL.
ru: Внутренняя ошибка обработки результата в модуле systeminfo: модуль равен NULL.

source: Internal error in systeminfo module when handle results: *ctx is NULL.
ru: Внутренняя ошибка обработки результата в модуле systeminfo: *ctx равен NULL.

source: Can't handle result of unknown systeminfo subcommand.
ru: Невозможно получить результат неизвестной команды в модуле systeminfo.

source: D-Bus error in systeminfo license handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo device: невозможно получить результат.

source: Wrong answer type in systeminfo license.
ru: Неизвестный возвращаемый тип данных после исполнения команды systeminfo license.

source: Error while handling systeminfo license result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo license. Код возврата: %i.

source: D-Bus error in systeminfo hostname handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo hostname: невозможно получить результат.

source: Wrong answer type in systeminfo hostname.
ru: Неизвестный возвращаемый тип данных после исполнения команды systeminfo hostname.

source: Can't save hostname to description
ru: Невозможно отобразить имя хоста в методе description.

source: Failed to get host name.
ru: Не удалось получить имя хоста.

source: Empty systeminfo hostname result.
ru: systeminfo hostname вернул пустое значение.

source: Error while handling systeminfo hostname result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo hostname. Код возврата: %i.

source: D-Bus error in systeminfo name handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo name: невозможно получить результат.

source: Wrong answer type in systeminfo name.
ru: Неизвестный возвращаемый тип данных после исполнения команды systeminfo name.

source: Can't save OS name to description
ru: Невозможно выбрать отобразить название ОС в методе description.

source: Failed to get OS name.
ru: Не удалось получить имя ОС.

source: Empty systeminfo name result.
ru: systeminfo name вернул пустое значение.

source: Error while handling systeminfo name result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo name. Код возврата: %i.

source: D-Bus error in systeminfo arch handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo arch: невозможно получить результат.

source: Wrong answer type in systeminfo arch.
ru: Неизвестный возвращаемый тип данных после исполнения команды systeminfo arch.

source: Can't save arch to description
ru: Невозможно отобразить архитектуру системы в методе description.

source: Failed to get arch.
ru: Не удалось получить архитектуру системы.

source: Empty systeminfo arch result.
ru: systeminfo arch вернул пустое значение.

source: Error while handling systeminfo arch result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo arch. Код возврата: %i.

source: D-Bus error in systeminfo branch handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo branch: невозможно получить результат.

source: Wrong answer type in systeminfo branch.
ru: Неизвестный возвращаемый тип данных после исполнения команды systeminfo branch.

source: Can't save branch to description
ru: Невозможно отобразить название ветки текущего репозитория.

source: Failed to get branch name.
ru: Не удалось получить название ветки текущего репозитория.

source: Empty systeminfo branch result.
ru: systeminfo branch вернул пустое значение.

source: Error while handling systeminfo branch result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo branch. Код возврата: %i.

source: D-Bus error in systeminfo kernel handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo kernel: невозможно получить результат.

source: Wrong answer type in systeminfo kernel.
ru: Неизвестный возвращаемый тип данных после исполнения команды systeminfo kernel.

source: Can't save kernel name to description
ru: Не удалось отобразить имя ядра в методе description.

source: Failed to get kernel.
ru: Невозможно получить версию ядра.

source: Empty systeminfo kernel result.
ru: systeminfo kernel вернул пустое значение.

source: Error while handling systeminfo kernel result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo kernel. Код возврата: %i.

source: D-Bus error in systeminfo cpu handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo cpu: невозможно получить результат.

source: Wrong answer type in systeminfo cpu.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды systeminfo cpu.

source: Can't save CPU to description
ru: Невозможно отобразить CPU в методе description

source: Failed to get cpu.
ru: Не удалось получить информацию о CPU.

source: Empty systeminfo cpu result.
ru: systeminfo cpu вернул пустое значение.

source: Error while handling systeminfo cpu result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo cpu. Код возврата: %i.

source: Invalid amount of CPU data.
ru: Некорректный объём данных о ЦПУ.

source: D-Bus error in systeminfo gpu handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo gpu: невозможно получить результат.

source: Wrong answer type in systeminfo gpu.
ru: Неизвестный возвращаемый тип данных после исполнения команды systeminfo gpu.

source: Can't save GPU to description
ru: Невозможно отобразить GPU в методе description

source: Failed to get gpu.
ru: Не удалось получить информацию о GPU.

source: Empty systeminfo gpu result.
ru: systeminfo gpu вернул пустое значение.

source: Error while handling systeminfo gpu result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo gpu. Код возврата: %i.

source: D-Bus error in systeminfo memory handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo memory: невозможно получить результат.

source: Wrong answer type in systeminfo memory.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды systeminfo memory.

source: Can't save RAM volume to description
ru: Невозможно отобразить размер ОЗУ в методе description.

source: Failed to get memory.
ru: Не удалось получить объем ОЗУ.

source: Empty systeminfo memory result.
ru: systeminfo memory вернул пустое значение.

source: Error while handling systeminfo memory result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo memory. Код возврата: %i.

source: D-Bus error in systeminfo drive handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo drive: невозможно получить результат.

source: Wrong answer type in systeminfo drive.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды systeminfo drive.

source: Can't save total memory volume to description
ru: Невозможно отобразить объеём всей памяти устройства в методе description

source: Failed to get drive volume.
ru: Не удалось получить объём всей памяти.

source: Empty systeminfo drive result.
ru: systeminfo drive вернул пустое значение.

source: Error while handling systeminfo drive result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo drive. Код возврата: %i.

source: D-Bus error in systeminfo monitor handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo monitor: невозможно получить результат.

source: Wrong answer type in systeminfo monitor.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды systeminfo monitor.

source: Can't save monitor to description
ru: Невозможно отобразить монитор в методе description.

source: Failed to get monitor.
ru: Не удалось получить информацию о мониторе.

source: Empty systeminfo monitor result.
ru: systeminfo monitor вернул пустое значение.

source: Error while handling systeminfo monitor result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo monitor. Код возврата: %i.

source: D-Bus error in systeminfo motherboard handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo motherboard: невозможно получить результат.

source: Wrong answer type in systeminfo motherboard.
ru: Неизвестный возвращаемый тип данных после исполнения команды systeminfo motherboard.

source: Can't save motherboard to description
ru: Невозможно отобразить материнскую плату в методе description

source: Failed to get motherboard.
ru: Не удалось получить информацию о материнской плате.

source: Empty systeminfo motherboard result.
ru: systeminfo motherboard вернул пустое значение.

source: Error while handling systeminfo motherboard result. Exit code: %i.
ru: Ошибка DBus во время работы метода systeminfo motherboard в %i: код возврата равен NULL.

source: D-Bus error in systeminfo locales handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo locales: невозможно получить результат.

source: Wrong answer type in systeminfo locales.
ru: Неизвестный возвращаемый тип данных после исполнения команды systeminfo locales.

source: Can't save locales to description
ru: Невозможно отобразить список локалей в методе description.

source: Failed to get locales.
ru: Не удалось получить текущyю локализацию.

source: Empty systeminfo locales result.
ru: systeminfo locales вернул пустое значение.

source: Error while handling systeminfo locales result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo locales. Код возврата: %i.

source: D-Bus error in systeminfo desktops handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo desktops: невозможно получить результат.

source: Wrong answer type in systeminfo desktops.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды systeminfo desktops.

source: Can't save desktop environments to description
ru: Невозможно отобразить переменные графических окружений в методе description.

source: Failed to get desktops.
ru: Не удалось получить информацию о графическом окружении.

source: Empty systeminfo desktops result.
ru: systeminfo desktops вернул пустое значение.

source: Error while handling systeminfo desktops result. Exit code: %i.
ru: Ошибка при получении результата команды systeminfo desktops. Код возврата: %i.

source: Empty systeminfo desktop environments result.
ru: systeminfo desktops вернул пустое значение.

source: alteratorctl systeminfo [COMMAND] [OPTIONS]
ru: alteratorctl systeminfo [КОМАНДА] [ОПЦИИ]

source: alteratorctl systeminfo Get information about the system (exclude os license agreement)
ru: alteratorctl systeminfo Получить информацию о системе (исключая лицензионной соглашение ОС)

source: arch Get operation system arch
ru: arch Получить архитектуру ОС

source: branch Get operation system branch
ru: branch Получить название ветки ОС

source: cpu Get information about CPU
ru: cpu Получить информацию о ЦПУ

source: description Get information about the system (exclude os license agreement) (default command)
ru: description Получить информацию о системе (исключая лицензионной соглашение ОС) (команда по умолчанию)

source: desktops Get desktop environments
ru: desktops Получить список установленных графических окружений

source: drive Get information about drive volume
ru: drive Получить объём всей памяти

source: gpu Get information about GPU
ru: gpu Вывести информацию о графическом процессоре

source: hostname Get host name
ru: hostname Получить имя хоста

source: kernel Get operation system kernel
ru: kernel Получить название ядра операционной системы

source: locales Get list of user(s) locales
ru: locales Получить локализацию пользователя(ей)

source: memory Get information about RAM memory volume
ru: memory Получить объём ОЗУ

source: monitor Get information about monitor
ru: monitor Получить информацию о мониторе

source: motherboard Get information about motherboard
ru: motherboard Получить информацию о материнской плате

source: name Get operation system name
ru: name Получить название ОС

source: -h, --help Show module systeminfo usage
ru: -h, --help Вызов справки модуля systeminfo

source: D-Bus context init error: unvaliable service name.
ru: Ошибка инициализации контекста D-Bus: недействительное имя сервиса.

source: D-Bus context init error: unvaliable path to object.
ru: Ошибка инициализации контекста D-Bus: недействительный путь к объекту.

source: D-Bus context init error: unvaliable interface name.
ru: Ошибка инициализации контекста D-Bus: недействительное имя интерфейса.

source: D-Bus context init error: unvaliable method name.
ru: Ошибка инициализации контекста D-Bus: недействительное имя метода.

source: Invalid D-Bus connection timeout value.
ru: Невалидный таймаут D-Bus соединения.

source: Error of creating alteratorctl_ctx_t to manager module.
ru: Ошибка создания общего контекста alteratorctl_ctx_t в модуле manager.

source: Error of creating alteratorctl_ctx_t to packages module.
ru: Ошибка создания общего контекста alteratorctl_ctx_t в модуле packages.

source: Error of creating alteratorctl_ctx_t to editions module.
ru: Ошибка создания общего контекста alteratorctl_ctx_t в модуле editions.

source: Error of creating alteratorctl_ctx_t to components module.
ru: Ошибка создания общего контекста alteratorctl_ctx_t в модуле components.

source: Error of creating alteratorctl_ctx_t to diag module.
ru: Ошибка создания общего контекста alteratorctl_ctx_t в модуле diag.

source: Error of creating alteratorctl_ctx_t to systeminfo module.
ru: Ошибка создания общего контекста alteratorctl_ctx_t в модуле systeminfo.

source: Error of creating alteratorctl_ctx_t to remote module.
ru: Ошибка создания общего контекста alteratorctl_ctx_t в модуле remote.

source: Error of creating alteratorctl_ctx_t to services module.
ru: Ошибка создания общего контекста alteratorctl_ctx_t в модуле services.

source: Can't read unspecified file.
ru: Невозможно прочитать неуказанный файл.

source: File %s doesn't exist.
ru: Файл %s не существует.

source: Error of reading file %s: %s
ru: Ошибка чтения файла %s: %s

source: In dup2 to redirect the thread from id %u to "%s" failed. Return code: -1
ru: Перенаправление потока с идентификатором %u в "%s" провалилась. Код возврата: -1

source: In dup2 to redirect the thread from id %u to file descriptor %u. Return code: -1
ru: Перенаправление потока с идентификатором %u в другой поток с идентификатором %u. Код возврата: -1

source: Can't make STDOUT descriptor backup
ru: Невозможно создать резервную копию дескриптора STDOUT

source: Can't make STDERR descriptor backup
ru: Невозможно создать резервную копию дескриптора STDERR

source: Error while open "/dev/null" file descriptor: %s
ru: Ошибка при открытии "/dev/null" дескриптора файла: %s

source: Failed to parse html text.
ru: Не удалось обработать html текст.

source: Unable to format output into columns: %s
ru: Невозможно разбить текст на колонки: %s

source: Failed to open /dev/tty
ru: Не удалось открыть /dev/tty

source: Failed to get terminal attributes
ru: Не удалось получить текущие настройки терминала

source: Enter password for '%s':
ru: Введите пароль (параметр '%s'):

source: Failed to read password input
ru: Не удалось прочитать пароль

source: Re-enter password for '%s':
ru: Подтвердите пароль (параметр '%s'):

source: Failed to read password confirmation
ru: Не удалось прочитать повторно введённый пароль

source: Password cannot be empty
ru: Пароль не может быть пустым

source: Passwords do not match
ru: Пароли не совпадают

source: Error registering local authentication agent: %s (%s, %d)
ru: Ошибка регистрации локального агента аутентификации: %s (%s, %d)

source: Error creating textual authentication agent: %s (%s, %d)
ru: Ошибка регистрации агента текстовой аутентификации: %s (%s, %d)

source: Not enough arguments.
ru: Недостаточно аргументов.

source: Can't parse aruments
ru: Невозможно обработать аргументы

source: Module %s isn't found.
ru: Модуль %s не найден.

source: alteratorctl [OPTIONS]
ru: alteratorctl [ОПЦИИ]

source: alteratorctl <MODULE> [COMMAND] [OPTIONS]
ru: alteratorctl <МОДУЛЬ> [КОМАНДА] [ОПЦИИ]

source: alteratorctl <MODULE> <SUBMODULE> [COMMAND] [OPTIONS]
ru: alteratorctl <МОДУЛЬ> <ПОДМОДУЛЬ> [КОМАНДА] [ОПЦИИ]

source: -h, --help Show usage help
ru: -h, --help Вывести справку

source: -v, --verbose Be verbose
ru: -v, --verbose Режим подробного вывода информации

source: --version Get alteratorctl version
ru: --version Получить версию alteratorctl

source: -m, --modules Lists registered client modules
ru: -m, --modules Отобразить зарегистрированные модули

source: For more information on a specific module and its subcommands, use: alteratorctl <MODULE> (-h | --help)
ru: Для получения дополнительной информации по конкретному модулю и его подкомандам используйте: alteratorctl <МОДУЛЬ> (-h | --help)

source: Internal error, app is NULL.
ru: Внутренняя ошибка, не удалось инициализировать приложение.

source: Internal error in get_packages_module: unvaliable id of packages module.
ru: Внутренняя ошибка в get_packages_module: недействительный id модуля packages.

source: Error of creating commands HashTables in packages module
ru: Ошибка создания хеш-таблиц с идентификаторами команд модуля packages

source: Internal error in packages module run: *module is NULL.
ru: Внутренняя ошибка модуля packages при исполнении главной логики: *module равен NULL.

source: Internal error in packages module run: *context is NULL.
ru: Внутренняя ошибка модуля packages при исполнении главной логики: *context равен NULL.

source: Try to run unknown packages subcommand.
ru: Попытка запуска модуля packages с неизвестными командами.

source: No packages module.
ru: Модуль packages не существует.

source: NULL context in rpm module.
ru: Данные подмодуля packages rpm пусты.

source: Not enough parameters for packages rpm files subcommand.
ru: Недостаточно параметров для подкоманды packages rpm files.

source: Can't allocate dbus_ctx_t in packages_module_rpm_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде packages_module_rpm_subcommand

source: Error while getting info of packages rpm submodule on alterator entry format: result is NULL.
ru: Ошибка при получении информации о packages rpm в формате alterator entry: результат равен NULL.

source: Not enough parameters for packages rpm install subcommand.
ru: Недостаточно параметров для подкоманды packages rpm install.

source: Not enough parameters for packages rpm packageinfo subcommand.
ru: Недостаточно параметров для подкоманды packages rpm packageinfo.

source: Not enough parameters for packages rpm remove subcommand.
ru: Недостаточно параметров для подкоманды packages rpm remove.

source: NULL context in apt module.
ru: Данные подмодуля packages apt пусты.

source: Error while getting info of packages apt submodule on alterator entry format: result is NULL.
ru: Ошибка при получении информации о packages apt в формате alterator antry: результат равен NULL.

source: Can't allocate dbus_ctx_t in packages_module_apt_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде packages_module_apt_subcommand

source: Not enough parameters for packages apt install subcommand.
ru: Недостаточно параметров для подкоманды packages apt install.

source: Invalid type of additional data for packages apt remove subcommand.
ru: Некорректный тип данных дополнительной информации для команды packages apt remove.

source: Invalid type of additional data for packages apt install subcommand.
ru: Некорректный тип данных дополнительной информации для команды packages apt install.

source: Can't check apply packages. Empty result.
ru: Ошибка CheckApply: пустой результат.

source: Calling of apt %s failed. Can't allocate memory for stdout signal.
ru: Вызов apt %s закончился неудачей. Невозможно выделить память для stdout signal.

source: Calling of apt %s failed. Can't allocate memory for stderr signal.
ru: Вызов apt %s закончился неудачей. Невозможно выделить память для stderr signal.

source: Can't allcate dbus_ctx_t in packages_module_apt_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде packages_module_apt_subcommand

source: Not enough parameters for packages apt reinstall subcommand.
ru: Недостаточно параметров для подкоманды packages apt reinstall.

source: Calling of apt reinstall async failed. Can't allocate memory for stdout signal.
ru: Вызов apt reinstall async закончился неудачей. Невозможно выделить память для stdout signal.

source: Calling of apt reinstall async failed. Can't allocate memory for stderr signal.
ru: Вызов apt reinstall async закончился неудачей. Невозможно выделить память для stderr signal.

source: Not enough parameters for packages apt search subcommand.
ru: Недостаточно параметров для подкоманды packages apt search.

source: Calling of apt update async failed. Can't allocate memory for stdout signal.
ru: Вызов apt update async закончился неудачей. Невозможно выделить память для stdout signal.

source: Calling of apt update async failed. Can't allocate memory for stderr signal.
ru: Вызов apt update async закончился неудачей. Невозможно выделить память для stderr signal.

source: NULL context in repo module.
ru: Данные подмодуля packages repo пусты.
