Repository: dvoropaev/alterator-for-doc
Catalog: subprojects/alteratorctl/po/alteratorctl.po
Languages: ru

source: The call to the diag report method failed. The module doesn't exist.
ru: Вызов метода diag report завершился неудачей. Модуль не существует.

source: The call to the diag report method failed. Module data is empty.
ru: Вызов метода diag report завершился неудачей. Данные модуля пусты.

source: The call to the diag report method failed. Tool name or path to it's object on D-Bus is empty.
ru: Вызов метода diag report завершился неудачей. Имя инструмента или путь до его объекта на D-Bus пусты.

source: Can't create session bus report of %s tool in root mode.
ru: Невозможно создать отчёт инструмента %s от имени root.

source: <<< Tests on the system bus
ru: <<< Тесты на системной шине:

source: <<< Tests on the session bus
ru: <<< Тесты на сессионной шине:

source: The call to the diag run method failed. The module doesn't exist.
ru: Вызов метода diag run завершился неудачей. Модуль не существует.

source: The call to the diag run method failed. Module data is empty.
ru: Вызов метода diag run завершился неудачей. Данные модуля пусты.

source: The call to the diag run method failed. Tool name or path to it's object on D-Bus is empty.
ru: Вызов метода diag run завершился неудачей. Имя инструмента или путь до его объекта на D-Bus пусты.

source: The call to the diag run method failed. Test name is empty.
ru: Вызов метода diag info завершился неудачей. Имя теста пустое.

source: Object %s isn't exists on system bus or has invalid interface.
ru: Объект %s не существует на системной шине или имеет невалидный интерфейс

source: Object %s isn't exists on session bus or has invalid interface.
ru: Объект %s не существует на сессионной шине или имеет невалидный интерфейс

source: Object %s isn't exists or has invalid interface.
ru: Объект %s не существует или имеет невалидный интерфейс.

source: Can't run tests of %s tool in session bus in root mode.
ru: Невозможно запустить тест диагностического инструмента %s на сессионной шине из-под root.

source: Can't process the result in diag module. The diag module doesn't exist.
ru: Невозможно обработать результат в модуле diag. Модуль diag не существует.

source: Can't process the result in diag module. Module data is empty.
ru: Невозможно обработать результат в модуле diag. Данные модуля пусты.

source: Unknown subcommand to handle results in diag module.
ru: Неизвестная подкоманда в модуле diag.

source: Can't process the result of diag info method. The diag module doesn't exist.
ru: Невозможно обработать результат команды diag info. Модуль diag не существует.

source: Can't process the result of diag info method. Module data is empty.
ru: Невозможно обработать результат команды diag info. Данные модуля пусты.

source: The call to the diag info method failed. Tool path on D-Bus is empty.
ru: Вызов метода diag info завершился неудачей. Путь объекта инструмента на D-Bus пуст.

source: Empty result of the diag info method
ru: Пустой результат в метода diag info

source: Can't get tests list of empty diagnostic tool
ru: Невозможно получить список тестов пустого диагностическиго инструмента.

source: Diag tool %s doesn't exist in session bus.
ru: Диагностический инструмент %s не найден на сессионной шине

source: Can't process the result of diag list method. The diag module doesn't exist.
ru: Невозможно обработать результат команды diag list. Модуль diag не существует.

source: Can't process the result of diag list method. Module data is empty.
ru: Невозможно обработать результат команды diag list. Данные модуля пусты.

source: Empty result of the diag list method.
ru: Пустой результат в метода diag list.

source: Empty tests of diagnostic tool %s in system bus
ru: Нет тестов у диагностического инструмента %s на системной шине

source: <<< Tests on system bus:
ru: <<< Тесты на системной шине:

source: Empty tests of diagnostic tool %s in session bus
ru: Нет тестов у диагностического инструмента %s на сeссионной шине

source: <<< Tests on session bus:
ru: <<< Тесты на сессионной шине:

source: <<< Tools on system bus:
ru: <<< Инструменты на системной шине:

source: <<< Tools on session bus:
ru: <<< Инструменты на сессионной шине:

source: Can't process the result of diag report method. The diag module doesn't exist.
ru: Невозможно обработать результат команды diag report. Модуль diag не существует.

source: Can't process the result of diag report method. Module data is empty.
ru: Невозможно обработать результат команды diag report. Данные модуля пусты.

source: Can't process the result of diag report method. Report filename is empty.
ru: Невозможно обработать результат команды diag report. Путь к файлу с отчётом пуст.

source: Empty result of the diag report method.
ru: Пустой результат в метода diag report.

source: Can't save report from %s. Exit code: %i
ru: Невозможно сохранить report инструмента %s. Код возврата: %i

source: Can't save report from %s. File extension is empty.
ru: Невозможно сохранить report инструмента %s. Пустое расширение файла.

source: Can't save empty report from %s
ru: Невозможно сохранить report в файл: %s

source: Can't open file to write a report: %s
ru: Невозможно записать report в файл: %s

source: Error writing report to file: %s
ru: Ошибки при записи report'a в файл: %s

source: Report %s created
ru: Report %s записан

source: Module diag options parsing failed: %s
ru: Обработка опций модуля diag завершилась неудачей: %s

source: Can't get alterator entry data for validation in module diag: field "%s" is missing.
ru: Невозможно получить данные alterator entry в модуле diag: пропущено поле "%s".

source: Can't get alterator entry data for validation in module diag: table "%s" is missing.
ru: Невозможно получить данные alterator entry в модуле diag: пропущено поле "%s".

source: Can't get list of tests from object %s.
ru: Невозможно получить список тестов инструмента %s

source: No tests were found in the tool %s
ru: В диагностическом инструменте %s тесты не были найдены

source: No test named %s was found in the tool %s
ru: Тест %s не найден в диагностическом инструменте %s

source: Running test in diag tool failed. Can't allocate memory for stdout signal.
ru: Запуск теста диагностического инструмента закончился неудачей. Невозможно выделить память для stdout signal.

source: Running test in diag tool failed. Can't allocate memory for stderr signal.
ru: Запуск теста диагностического инструмента закончился неудачей. Невозможно выделить память для stderr signal.

source: Running test in diag tool failed. Can't allocate memory for D-Bus context.
ru: Запуск теста диагностического инструмента закончился неудачей. Невозможно выделить память для D-Bus context.

source: Running test in diag tool failed. Failed to get terminal width: %s
ru: Запуск теста диагностического инструмента закончился неудачей. Не удалось получить ширину терминала: %s.

source: The "%s" test is started
ru: Тест "%s" запущен

source: [PASS]
ru: [ ВЫПОЛНЕНО ]

source: [FAIL]
ru: [ ПРОВАЛЕНО ]

source: [WARN]
ru: [ПРЕДУПРЕЖДЕНИЕ]

source: Error in diag report module: can't get alterator entry data of %s object.
ru: Ошибка в модуле diag: невозможно получить данные alterator entry объекта %s.

source: Error in diag report: ReportSuffix from %s not found
ru: Ошибка при выполнении diag report: ReportSuffix из %s не найден

source: Error in diag report: ReportSuffix from %s data type isn't a string
ru: Ошибка при выполнении diag report: тип данных ReportSuffix из %s не является строкой

source: Error in diag report: ReportSuffix from %s hasn't been initialized
ru: Ошибка при выполнении diag report: ReportSuffix из %s не был инициализирован

source: Internal error of diag report: can't allocate D-Bus context.
ru: Внутренняя ошибка при выполнении diag report: невозможно выделить память для D-Bus context.

source: Directories
ru: Директории

source: Files
ru: Файлы

source: Systemd units
ru: Юниты systemd

source: Ports
ru: Порты

source: Other resources
ru: Другие ресурсы

source: Invalid playfile parameters for service "%s".
ru: Некорректные параметры в файле для сервиса "%s".

source: Failed to parse info for service "%s".
ru: Не удалось обработать информацию для сервиса "%s".

source: Force-deploy is not available for service "%s".
ru: Сервис "%s" не поддерживает принудительное развёртывание.

source: Invalid diagnostics tests list for "%s".
ru: Неправильный список диагностических инструментов в секции "%s".

source: Invalid input json data. Invalid 'options.autostart'.
ru: Некорректные входные данные в формате Json. Неправильный данные 'options.autostart'.

source: Invalid input json data. Invalid 'options.force'.
ru: Некорректные входные данные в формате Json. Неправильный данные 'options.force'.

source: playfile
ru: файла со сценарием запуска

source: Running %s diagnostics requested in playfile for service "%s".
ru: Запуск %s диагностики указан в файле со сценарием запуска сервиса "%s".

source: Failed to determine service path for diagnostics.
ru: Не удалось определить путь объекта сервиса для диагностики.

source: Unknown diagnostic tool "%s" for service "%s".
ru: Неизвестный диагностический инструмент "%s" сервиса "%s".

source: Unknown diagnostic test "%s" in "%s" tool.
ru: Неизвестный диагностический тест "%s" диагностического инструмента "%s".

source: Playfile did not list all required tests for "%s"; they will be added automatically.
ru: Файл со сценарием запуска сервиса содержит не все обязательные тесты диагностического инструмента "%s"; они будут добавлены автоматически.

source: <<< Tests on the system bus:
ru: <<< Тесты на системной шине:

source: <<< Tests on the session bus:
ru: <<< Тесты на сессионной шине:

source: Running test "%s" from "%s".
ru: Запуск теста "%s" диагностического инстурмента "%s".

source: Some %s diagnostics failed for service "%s".
ru: Диагностика в режиме %s у сервиса "%s" закончилась неудачей.

source: Do you want to continue? [y/N] y
ru: Продолжить? [y/N] y

source: To confirm the operation, repeat the input with the --yes flag.
ru: Для подтверждения операции повторите запрос с опцией --yes.

source: diagnostics
ru: диагностика

source: Do you want to save diagnostics log to a file? [y/N] y
ru: Сохранить вывод диагностических инструментов в файл? [y/N] y

source: Do you want to save diagnostics log to a file? [y/N]
ru: Сохранить вывод диагностических инструментов в файл? [y/N]

source: Diagnostics log for service "%s" (%s)
ru: Вывод диагностики сервиса "%s" (%s)

source: Failed to save diagnostics log to %s: %s
ru: Не удалось сохранить вывод диагностики в файл %s: %s.

source: Diagnostics log has been saved to %s.
ru: Вывод диагностики сервиса сохранен в %s.

source: Internal error in get_services_module: unvaliable id of services module.
ru: Внутренняя ошибка в get_services_module: недействительный id модуля services.

source: Internal data error in services module with args: AlteratorCtlServicesModule *module is NULL.
ru: Внутренняя ошибка в модуле services c аргументами: AlteratorCtlServicesModule *module равен NULL.

source: Services module options parsing failed: %s.
ru: Обработка опций модуля services завершилась неудачей: %s

source: Wrong arguments in services module.
ru: Неправильные аргументы модуля services.

source: Error of parsing diagnose command arguments. Failed of getting "%s" service status.
ru: Ошибка обработки аргументов команды diagnose. Не удалось получить статус сервиса "%s".

source: Can't create help for "services diagnose %s" with empty dianostic tools tests.
ru: Невозможно создать справку для команды "services diagnose %s" из-за отсутствия тестов диагностических инструментов.

source: service "%s" doesn't offer diagnostic tests.
ru: У сервиса "%s" нет диагностических тестов.

source: No diagnostic tests in "%s" service.
ru: У сервиса "%s" нет диагностических тестов.

source: Error of parsing diagnose command arguments. Diagnostic tool "%s" of service "%s" doesn't exist.
ru: Ошибка обработки аргументов команды diagnose. Диагностический инструмент "%s" сервиса "%s" не существует.

source: Error of parsing diagnose command arguments. Diagnostic tool "%s" of service "%s" doesn't have tests.
ru: Ошибка обработки аргументов команды diagnose. Диагностический инструмент "%s" сервиса "%s" не содержит тестов.

source: The diagnostic tool name "%s" has already been specified before.
ru: Диагностический инструмент "%s" уже был указан ранее.

source: Diagnostic tool must be specified first.
ru: Первым должно быть указано название диагностического инструмента.

source: Test "%s" of diagnostic tool "%s" either does not apply to "%s-diag" mode or does not exist.
ru: Тест "%s" диагностического инструмента "%s" либо не можент использоваться в режиме "%s-диагностики", либо не существует.

source: WARNING: The required test "%s" of the diagnostic tool "%s" was not specified. This test will be run.
ru: ПРЕДУПРЕЖДЕНИЕ: Обязательный тест "%s" диагностического инструмента "%s" не указан, но он будет запущен.

source: Internal error: failed to process an argument.
ru: Внутренняя ошибка: не удалось обработать аргумент.

source: Unknown parameter: '%s'.
ru: Неизвестный параметр: '%s'.

source: Invalid boolean value: %s.
ru: Некорректная логическая переменная: %s.

source: Internal error: invalid type of parameter '%s': '%s'.
ru: Внутренняя ошибка: некорректный тип параметра '%s': '%s'.

source: Selected enum value is '%s', but you are trying to set another subparameter '%s'.
ru: Выбранное значение перечисления - "%s", но вы пытаетесь установить подпараметр "%s" не относящийся к нему.

source: %s: invalid index %s.
ru: %s: неправильный индекс %s.

source: Invalid parameter: '%s'.
ru: Некорректный параметр: '%s'.

source: Invalid argument '%s'.
ru: Некорректный аргумент '%s'.

source: Parameter '%s' does not belong to context '%s'.
ru: Параметр '%s' не принадлежит контексту '%s'.

source: Parameter '%s' is null.
ru: Параметр '%s' не определён.

source: Parameter '%s' is required.
ru: Параметр '%s' является обязательным.

source: %s should be empty.
ru: %s не должен быть пустым.

source: %s should have at least %i items.
ru: %s должен иметь как минимум %i элементов.

source: %s should not have more items than %i.
ru: %s не должен иметь больше %i элементов.

source: %s should not be less than %i.
ru: %s не должен быть меньше %i.

source: %s should be less than %i.
ru: %s должен быть меньше %i.

source: The parameter %s value must not be empty.
ru: Значение параметра %s не может быть пустым.

source: The parameter %s value doesn't match the pattern %s.
ru: Параметр %s не соответствует паттерну %s.

source: One variant of enum "%s" should be selected.
ru: Один вариант перечисления "%s" должен быть выбран.

source: Only one variant of enum "%s" may be selected.
ru: Может быть выбран только один вариант у перечисления "%s".

source: The value '%s' for enum '%s' does not exist. Run '%s %s --help' to see the list of valid values.
ru: Значение '%s' перечисления '%s' не существует. Запустите '%s %s --help', чтобы увидеть список возможных значений.

source: The enum '%s' does not exist. Run '%s %s --help' to see the list of valid parameters.
ru: Перечисление '%s' не существует. Запустите '%s %s --help', чтобы увидеть список существующих переменых.

source: Passwords for '%s' do not match.
ru: Пароли для параметра '%s' не совпадают.

source: Password for '%s' is required.
ru: Требуется указать значение-пароль для параметра '%s'.

source: Failed to read password for '%s': %s
ru: Не удалось прочитать пароль для параметра '%s': %s

source: Can't save parsed parameters to empty variable.
ru: Невозможно сохранить обработанные параметры в неинициализированное хранилище.

source: Service returned invalid parameter type: '%s'.
ru: Сервис вернул некорректный тип параметра: '%s'.

source: Parsing '%s' failed.
ru: Обработка '%s' завершилась неудачей.

source: Error processing service %s parameters: empty service info.
ru: Ошибка обработки параметров сервиса %s: отсутствует информация о сервисе.

source: Mixing --input with other parameters is not supported.
ru: Использование --input с другими параметрами не поддерживается.

source: Invalid input json data.
ru: Некорректные входные данные в формате Json.

source: Failed to create service "%s %s" usage help. Empty options data.
ru: Не удалось создать справку для "%s %s". Отсутствует информация об опциях.

source: Failed to create service "%s %s" usage help. Nowhere to save the result.
ru: Не удалось создать справку для "%s %s". Некуда сохранить результат.

source: Minimum number of array elements: %lu
ru: Минимальный допустимый размер массива: %lu

source: Maximum number of array elements: %lu
ru: Максимальный допустимый размер массива: %lu

source: Default value: %s
ru: Значение по умолчанию: %s

source: alteratorctl diagnose %s (<diagnostic tool> [test...])... [PARAMETERS [arguments]]
ru: alteratorctl diagnose %s (<диагностический инструмент> [тест...])... [ПАРАМЕТРЫ [аргументы]]

source: Diagnostics tools of %s service:
ru: Диагностические инструменты сервиса "%s":

source: %s diagnostics tests in %s bus:
ru: Диагностические тесты инструменты %s на %s шине

source: system
ru: системной

source: serssion
ru: сессионной

source: Required
ru: Обязательный

source: Optional
ru: Необязательный

source: Can be run in pre-diagnostic mode
ru: Может быть запущен в режиме преддиагностики.

source: Can be run in post-diagnostic mode
ru: Может быть запущен в режиме постдиагностики.

source: Can be run in pre- and post-diagnostic modes
ru: Может быть запущен в режиме пред- и постдиагностики.

source: alteratorctl %s [OPTIONS] [PARAMETERS [arguments]]
ru: alteratorctl %s [ОПЦИИ] [ПАРАМЕТРЫ [аргументы]]

source: Parameters of "%s" service:
ru: Параметры сервиса "%s":

source: -a, --all Run all diagnostics tests in current mode (pre- or postdiagnostic)
ru: -a, --all Запустить все тесты в текущем режиме (пред- или постдиагностики)

source: -f, --force-deploy Force deploy service
ru: -f, --force-deploy Принудительное развёртывание сервиса

source: -y, --yes Assume Yes to all queries and do not prompt
ru: -y, --yes Автоматически отвечать 'ДА' на все вопросы

source: --no-default Do not use default value if parameter is not set
ru: --no-default Не использовать значения по умолчанию, если параметр не установлен

source: -h, --help Show "%s" command of "%s" service usage help
ru: -h, --help Отобразить справку команды "%s" сервиса "%s"

source: If you want to reset an optional parameter that has been set, simply omit it's value:
ru: Если вы хотите сбросить установленный необязательный параметр, то просто не пишите его значение:

source: Internal error: invalid arguments for services confirmation.
ru: Внутренняя ошибка: некорректные аргументы для подтверждения действия над сервисом.

source: Internal error: services info parser is not initialized.
ru: Внутренняя ошибка: обработчик информации о сервисе не инициализирован.

source: Checking resources conflicts...
ru: Проверка конфликтов ресурсов...

source: Continue executing "%s %s%s" with these parameters?
ru: Продолжить выполнение "%s %s%s" со следующими параметрами?

source: Continue executing "%s %s%s"?
ru: Продолжить выполнение "%s %s%s"?'

source: Check the specified parameters for the %s service. Required parameters that are not set are marked with "*" and must be provided when running the %s command. %s
ru: Проверьте указанные параметры сервиса "%s". Обязательные параметры, которые не установлены, отмечены символом "*" и должны быть указаны при запуске команды %s. %s

source: Aborted.
ru: Прервано.

source: Internal error in services module while parsing arguments: *iface is NULL.
ru: Внутренняя ошибка модуля services при обработке аргументов: *iface равен NULL.

source: Unknown services module command.
ru: Неизвестная команда модуля services.

source: Usage: services play <file|->
ru: Использование: services play <файл|->

source: Execute action from JSON file
ru: Выполнить действие, указанное в Json файле

source: No input file specified.
ru: Json файл не указан.

source: Invalid or empty input json data.
ru: Входные данные в формате Json некорректные, либо отсутствуют.

source: Invalid input json data. Object is expected.
ru: Некорректные входные данные в формате Json. Ожидался объект.

source: Invalid input json data. Missing or invalid 'service'.
ru: Некорректные входные данные в формате Json. Пропущенное или недействительное поле 'service'.

source: This playfile uses outdated file format that's unsupported. Please export the playfile from a newer version of Alt-Services.
ru: Данный файл со сценарием запуска сервиса использует устаревший формат, который больше не поддерживаеся. Пожалуйста, экспортируйте файл из более новой версии Alt-Services.

source: Invalid input json data. Missing or invalid 'action'.
ru: Некорректные входные данные в формате Json. Пропущенное или недействительное поле 'action'.

source: Invalid input json data. Invalid 'version'.
ru: Некорректные входные данные в формате Json. Недействительное поле 'version'.

source: Unsupported playfile version: %d.
ru: Неподдерживаемая версия файла со сценарием запуска: %d.

source: Invalid input json data. Missing or invalid 'parameters'.
ru: Некорректные входные данные в формате Json. Пропущенное или недействительное поле 'parameters'.

source: Unsupported action '%s' in services play. Only the following actions are supported: 'deploy', 'undeploy', 'configure', 'backup' and 'restore'.
ru: Действие '%s' не поддерживается для команды 'play'. Поддерживаются только контексты: 'deploy', 'undeploy', 'configure', 'backup' and 'restore'.

source: Failed of parsing service "%s" info.
ru: Не удалось обработать информацию о сервисе "%s".

source: List services
ru: Вывести список сервисов

source: Usage: services list
ru: Использование: services list

source: Unknown arguments for list command.
ru: Неправильные аргументы для команды list.

source: Get info of specified service
ru: Получить информацию о выбранном сервисе

source: Usage: services info <service>
ru: Использование: services info <сервис>

source: Show resources of specified service
ru: Вывести ресурсы указанного сервиса

source: Usage: services resources <service>
ru: Использование: services resources <сервис>

source: Get current state and parameters of specified service
ru: Получить текущее состояние и параметры указанного сервиса

source: Usage: services status <service>
ru: Использование: services status <сервис>

source: Start specified service
ru: Запустить указанный сервис

source: Usage: services start <service>
ru: Использование: services start <сервис>

source: Stop specified service
ru: Остановить указанный сервис

source: Usage: services stop <service>
ru: Использование: services stop <сервис>

source: No service specified.
ru: Сервис не указан.

source: This command can not be used on a deployed service.
ru: Эта команда не может использоваться на развёрнутом сервисе.

source: This command can only be used on a deployed service.
ru: Эта команда может использоваться только на развёрнутом сервисе.

source: Failed to execute "%s" status. Error getting service alterator entry info.
ru: Ошибка исполнения "%s" status. Не удалось получить информацию о сервисе.

source: "%s" is not a parameter of diagnostic tests.
ru: "%s" не является параметром диагностических тестов.

source: Internal error in services module run: *module or *context is NULL.
ru: Внутренняя ошибка в модуле services: *module или *context равен NULL.

source: Internal error: Module doesn't exist.
ru: Внутренняя ошибка: Модуль не существует.

source: Service is not specified.
ru: Сервис %s не указан.

source: pre-deployment
ru: предразвёртывания

source: Internal error: Parameters missing.
ru: Внутренняя ошибка, app равен NULL.

source: Internal error: invalid JSON.
ru: Внутренняя ошибка: некорректный Json.

source: Internal error: unknown method.
ru: Внутренняя ошибка: неизвестный метод.
