Repository: dvoropaev/alterator-for-doc
Catalog: subprojects/alteratorctl/po/alteratorctl.po
Languages: ru

source: Wrong answer type in editions get.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды editions get.

source: D-Bus error in editions module while calling Current(): failed to produce a result.
ru: Ошибка D-Bus в модуле editions при вызове Current(): невозможно получить результат.

source: Error while running Current() method in: exit_code is NULL.
ru: Ошибка DBus во время работы метода Current(): код возврата равен NULL.

source: Module editions options parsing failed: %s
ru: Обработка опций модуля editions завершилась неудачей: %s

source: Internal error in editions module while parsing arguments: *iface is NULL.
ru: Внутренняя ошибка модуля editions при обработке аргументов: *iface равен NULL.

source: Wrong arguments in editions module.
ru: Неправильные аргументы в модуле editions.

source: Wrong arguments to license module command.
ru: Неправильные аргументы для команды editions license.

source: Wrong arguments to set module command.
ru: Неправильные аргументы для команды editions set.

source: Wrong arguments to get module command.
ru: Неправильные аргументы для команды edtitons get.

source: Unknown module editions command.
ru: Неизвестная команда модуля editions.

source: Can't get display name of edition %s. Display name data by key %s is empty.
ru: Невозможно получить отображаемое имя редакции %s. Полученное отображаемое имя по ключу %s пустое.

source: alteratorctl editions [[COMMAND] [edition]] [OPTIONS]
ru: alteratorctl editions [[КОМАНДА] [редакция]] [ОПЦИИ]

source: alteratorctl editions [OPTIONS] List editions
ru: alteratorctl editions [ОПЦИИ] Вывод списка редакций

source: description [edition] Get description of specified or current edition
ru: description [редакция] Получить описание выбранной или текущей редакции

source: get Get current edition name
ru: get Получить имя текущей редакции

source: info [edition] Get info about specified or current edition
ru: info [редакция] Вывести информацию о выбранной или текущей редакции

source: license [edition] Get license of specified or current edition
ru: license [редакция] Вывести лицензию выбранной или текущей редакции

source: list List editions
ru: list Вывести список редакций

source: set <edition> Choose the specified edition
ru: set <edition> Выбрать указанную редакцию

source: Options:
ru: Опции:

source: -v, --verbose Add editions paths to editions list output
ru: -v, --verbose Добавить к списку редакций пути к объектам на dbus

source: -d, --display-name-only Show only editions display names
ru: -d, --display-name-only Показать только отображаемые имена редакций

source: -D, --no-display-name Show editions without display names
ru: -D, --no-display-name Скрыть отображаемые имена редакций

source: -p, --path-only Show only editions objects paths on D-Bus
ru: -p, --path-only Отобразить только пути объектов редакций на D-Bus

source: -n, --name-only Show only editions objects names
ru: -n, --name-only Отобразить только имена объектов редакций

source: -N, --no-name Hide editions names
ru: -N, --no-name Скрыть отображение имен редакций

source: -H, --hide-installation-markers Hide the installed edition marker
ru: -H, --hide-installation-markers Скрыть маркер установленной редакции

source: -h, --help Show module editions usage
ru: -h, --help Вызов справки модуля editions

source: Internal error in get_manager_module: unvaliable id of manager module.
ru: Внутренняя ошибка в get_manager_module: недействительный id модуля manager.

source: Internal error in manager module run: *module or *interface is NULL.
ru: Внутренняя ошибка в модуле manager при исполнении manager_module_run - *module или *interface равен NULL.

source: Internal error in manager module run: *context is NULL.
ru: Внутренняя ошибка модуля manager при исполнении главной логики: *context равен NULL.

source: Try to run unknown manager subcommand.
ru: Попытка запуска неизвестной подкоманды в модуле manager.

source: Internal error in manager module - manager *module is NULL in "manager getobjects".
ru: Внутренняя ошибка в модуле manager - manager *module равен NULL в "manager getobjects".

source: <<< Objects on system bus:
ru: <<< Объекты на системной шине:

source: <<< Objects on session bus:
ru: <<< Объекты на сессионной шине:

source: No objects found on system & session bus.
ru: На системной и сессионной шине не найдено никаких объектов.

source: No objects found on system bus.
ru: На системной шине не найдено никаких объектов.

source: No objects found on session bus.
ru: На сессионной шине не найдено никаких объектов.

source: Internal error in manager module - AlteratorCtlManagerModule *module is NULL in "manager getifaces".
ru: Внутренняя ошибка в модуле manager - AlteratorCtlManagerModule *module равен NULL в "manager getifaces".

source: <<< Interfaces on system bus:
ru: <<< Интерфейсы на системной шине:

source: <<< Interfaces on session bus:
ru: <<< Интерфейсы на сессионной шине:

source: No interfaces found on system & session bus.
ru: На системной и сессионной шине не найдено никаких интерфейсов.

source: No interfaces found on system bus.
ru: На системной шине не найдено никаких интерфейсов.

source: No interfaces found on session bus.
ru: На сессионной шине не найдено никаких интерфейсов.

source: Internal error in manager module - AlteratorCtlManagerModule *module or context is NULL in "manager getsignals".
ru: Внутренняя ошибка в модуле manager - AlteratorCtlManagerModule *module или контекст равен NULL при исполнении команды "manager getsignals".

source: Wrong arguments in manager module method GetSignals().
ru: Неправильные аргументы в модуле manager в методе GetSignals().

source: Error when checking the presence of an object %s on D-Bus.
ru: Ошибка проверки наличия объекта %s на D-Bus.

source: Internal data error in manager module with args: AlteratorCtlDiagModule *module is NULL.
ru: Внутренняя ошибка в модуле manager c аргументами: AlteratorCtlDiagModule *module равен NULL.

source: Internal error in manager module when handle results: *module or *context is NULL.
ru: Внутренняя ошибка модуля manager при обработке результатов: *module или *context равен NULL.

source: D-Bus error in manager getobjects handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата manager getobjects: невозможно получить результат.

source: D-Bus error in manager getifaces handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата manager getifaces: невозможно получить результат.

source: D-Bus error in manager getsignals handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата manager getsignals: невозможно получить результат.

source: No signals found on system bus.
ru: На системной шине не найдено никаких сигналов.

source: No signals found on session bus.
ru: На сессионной шине не найдено никаких сигналов.

source: No signals found.
ru: Никаких сигналов не найдено.

source: alteratorctl manager <COMMAND [arguments]> [OPTIONS]
ru: alteratorctl manager <КОМАНДА [аргументы]> [ОПЦИИ]

source: getifaces [path] [--session | --system] Gets interfaces of specified object on system or/and session bus
ru: getifaces [путь] [--session | --system] Получить интерфейсы указанного объекта на системной и/или сессионной шине

source: getobjects [interface] [--session | --system] Gets objects paths that implements specified interface on system or/and session bus
ru: getobjects [интерфейс] [--session | --system] Получить пути объектов указанного интерфейса на системной и/или сессионной шине

source: getsignals <path> <interface> <method name> <--session | --system> Gets signals names of specified method on implemented interface of specifiead object on specified bus
ru: getsignals <путь> <интерфейс> <имя метода> <--session | --system> Получить сигналы указанного метода интерфейса указанного объекта на системной и/или сессионной шине

source: --session D-Bus session bus type
ru: --session Сессионная шина D-Bus

source: --system D-Bus system bus type
ru: --system Системная шина D-Bus

source: -h, --help Show manager module usage
ru: -h, --help Вызов справки подмодуля manager

source: Internal error in manager module while parsing arguments: *iface is NULL.
ru: Внутренняя ошибка модуля manager при обработке аргументов: *iface равен NULL.

source: Wrong arguments in manager module.
ru: Неправильные аргументы модуля manager.

source: Unknown manager module command.
ru: Неизвестная команда модуля manager.

source: To many arguments in getobjects manager module subcommand
ru: Слишком много аргументов для команды getobjects.

source: The bus type is specified repeatedly.
ru: Повторно указан тип шины.

source: Wrong bus type in getobjects manager module subcommand.
ru: Указан неправильный тип шины в вызове команды getobjects.

source: Can't initialize context in manager module getobjects subcommand.
ru: Невозможно инициализировать контекст при выполнении manager getobjects.

source: To many arguments in getifaces manager module subcommand.
ru: Слишком много аргументов для команды getifaces.

source: Wrong bus type in getifaces manager module subcommand.
ru: Указан неправильный тип шины в вызове команды getifaces.

source: Can't initialize context in manager module getifaces subcommand.
ru: Невозможно инициализировать контекст при выполнении manager getifaces.

source: Wrong argument to manager module getsignals subcommand.
ru: Неправильные аргументы команды manager getsignals.

source: Can't find bus in arguments.
ru: Шина не указана в аргументах командной строки

source: Can't initialize context in manager module getsignals subcommand.
ru: Невозможно инициализировать контекст при выполнении manager getsignals.

source: Internal error in get_remote_module: unvaliable id of remote module.
ru: Внутренняя ошибка в get_remote_module: недействительный id модуля remote.

source: Internal error in remote module while parsing arguments: *iface is NULL.
ru: Внутренняя ошибка модуля remote при обработке аргументов: *iface равен NULL.

source: Wrong arguments in remote module.
ru: Неправильные аргументы в модуле remote

source: Wrong remote module command.
ru: Неправильная команда модуля remote.

source: Wrong arguments to connect module command.
ru: Неправильные аргументы для команды connect.

source: Wrong arguments to disconnect module command.
ru: Неправильные аргументы для команды disconnect.

source: Unknown module remote command.
ru: Неизвестная команда в модуле remote.

source: Internal data error in remote module with args: AlteratorCtlRemoteModule *module is NULL.
ru: Внутренняя ошибка в модуле remote c аргументами: AlteratorCtlRemoteModule *module равен NULL.

source: Internal error in remote module run: *module or *context is NULL.
ru: Внутренняя ошибка в модуле remote: *module или *context равен NULL.

source: Try to run unknown remote subcommand.
ru: Попытка запуска неизвестной команды модуля remote.

source: Internal error in remote module - AlteratorCtlRemoteModule *module is NULL in "remote connect".
ru: Внутренняя ошибка в модуле remote - AlteratorCtlRemoteModule *module равен NULL при исполнении команды "remote connect".

source: Not enough parameters for remote connect subcommand.
ru: Недостаточно параметров для команды remote connect.

source: Can't allocate dbus_ctx_t in remote_module_connect_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде remote_module_connect_subcommand

source: D-Bus error in remote module while calling Connect(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата remote Connect(): невозможно получить результат.

source: Internal error in remote module - AlteratorCtlRemoteModule *module is NULL in "remote disconnect".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlRemoteModule *module равен NULL при исполнении команды "remote disconnect".

source: Not enough parameters for remote disconnect subcommand.
ru: Недостаточно параметров для подкоманды remote disconnect.

source: Can't allocate dbus_ctx_t in remote_module_disconnect_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде remote_module_disconnect_subcommand

source: D-Bus error in remote module while calling Disconnect(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата remote Disconnect(): невозможно получить результат.

source: Internal error in remote module - AlteratorCtlRemoteModule *module is NULL in "remote list".
ru: Внутренняя ошибка в модуле editions - AlteratorCtlRemoteModule *module равен NULL при исполнении команды "remote list".

source: Can't allocate dbus_ctx_t in remote_module_list_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде remote_module_list_subcommand

source: D-Bus error in remote module while calling GetConnections(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата remote GetConnections(): невозможно получить результат.

source: Internal error in remote module when handle results: *module is NULL.
ru: Внутренняя ошибка модуля manager при обработке результатов: *module равен NULL.

source: Internal error in remote module when handle results: *ctx is NULL.
ru: Внутренняя ошибка модуля remote при обработке результатов: *ctx равен NULL.

source: D-Bus error in remote connect handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата remote connect: невозможно получить результат.

source: Wrong answer type in remote connect
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды remote connect

source: Failed to create a connection
ru: Не удалось создать соединение

source: Remote object path: %s
ru: Путь к объекту удалённой машины: %s

source: D-Bus error in remote disconnect handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата remote disconnect: невозможно получить результат.

source: Wrong answer type in remote disconnect.
ru: Неизвестный возвращаемый тип данных после исполнения команды remote disconnect.

source: Failed to disconnect
ru: Не удалось разорвать соединение

source: D-Bus error in remote list handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата remote list: невозможно получить результат.

source: Wrong answer type in remote list.
ru: Неизвестный возвращаемый тип данных после исполнения команды remote list.

source: Invalid connection address: an '@' delimiter between name and IP is required.
ru: Недопустимый адрес подключения: ожидается разделитель '@' между именем пользователя и IP.

source: Invalid connection address: can't split connection address to username and IP.
ru: Недопустимый адрес подключения: невозможно разобрать адрес на имя пользователя и IP.

source: Invalid connection address: username is empty.
ru: Недопустимый адрес подключения: пустое имя пользователя.

source: Invalid connection address: invalid IP.
ru: Недопустимый адрес подключения: некорректный IP.

source: alteratorctl remote <COMMAND> [arguments] [OPTIONS]
ru: alteratorctl remote <КОМАНДА> [аргументы] [ОПЦИИ]

source: connect <remote address> <connection name> <agent bus name> <pty> Connect to a remote machine via ssh
ru: connect <адрес подключения> <имя подключения> <путь password agent'а> <псевдотерминал> Подключиться к удалённой машине по ssh

source: disconnect <connection name> Disconnect from the remote machine
ru: disconnect <имя подключения> Отключиться от удалённой машины

source: list Get the list of names of installed ssh connections
ru: list Получить список открытых ssh-соединений

source: -h, --help Show module remote usage
ru: -h, --help Вызов справки модуля components

source: Can't validate password agent: wrong password agent service, path or iface.
ru: Невозможно проверить password agent: неправильное имя сервиса, путь объекта или имя интерфейса на dbus.

source: Can't get services names in D-Bus system bus
ru: Невозможно получить имена сервисов на системной шине D-Bus

source: %s service not found.
ru: Сервис %s не найден.

source: Can't get introspection of password agent by path: %s in service: %s
ru: Невозможно получить результат интроспекции password agent'а по пути: %s на сервисе: %s

source: Password agent with iface %s doesn't exists.
ru: Password agent с интерфейсом %s не существует.

source: Internal error in get_systeminfo_module: unvaliable id of systeminfo module.
ru: Ошибка при исполнении get_systeminfo_module: недействительный id модуля systeminfo.

source: Internal error in systeminfo module while parsing arguments: *iface is NULL.
ru: Внутренняя ошибка модуля systeminfo при обработке аргументов: *iface равен NULL.

source: Wrong arguments in systeminfo module
ru: Неправильные аргументы в модуле systeminfo

source: Unknown module systeminfo command.
ru: Неизвестная команда в модуле systeminfo.

source: Internal data error in systeminfo module with args: AlteratorCtlSystemInfoModule *module is NULL.
ru: Внутренняя ошибка в модуле systeminfo при его запуске - AlteratorCtlSystemInfoModule *module равен NULL.

source: Internal error in systeminfo module run: *module or *context is NULL.
ru: Внутренняя ошибка в модуле systeminfo при исполнении systeminfo_module_run - *module или *context равен NULL.

source: Try to run unknown systeminfo subcommand.
ru: Попытка запуска модуля systeminfo с неизвестными командами.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo license".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo license".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_license_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_license_subcommand

source: Object %s and/or interface %s doesn't exists.
ru: Объект %s и/или интерфейс %s отсутствует.

source: D-Bus error in systeminfo module while calling GetLicense(): failed to produce a result
ru: Ошибка D-Bus при обработке результата systeminfo GetLicense(): невозможно получить результат.

source: Failed to save the result of describing all the information about the system.
ru: Не удалось сохранить информацию о системе.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo device".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo device".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_device_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_device_subcommand

source: D-Bus error in systeminfo module while calling GetDeviceName(): failed to produce a result.
ru: Ошибка D-Bus в модуле systeminfo при вызове GetDeviceName(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo name".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo name".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_operation_system_name_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_operation_system_name_subcommand

source: D-Bus error in systeminfo module while calling GetOperationSystemName(): failed to produce a result.
ru: Ошибка D-Bus в модуле systeminfo при вызове GetOperationSystemName(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo arch".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo arch".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_arch_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_arch_subcommand

source: D-Bus error in systeminfo module while calling Arch(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo Arch(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo branch".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo branch".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_branch_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_branch_subcommand

source: D-Bus error in systeminfo module while calling GetBranch(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo GetBranch(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo kernel".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo kernel".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_kernel_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_kernel_subcommand

source: D-Bus error in systeminfo module while calling GetKernel(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo GetKernel(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo cpu".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo cpu".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_cpu_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_cpu_subcommand

source: D-Bus error in systeminfo module while calling GetCPU(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo GetCPU(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo gpu".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo gpu".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_gpu_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_gpu_subcommand

source: D-Bus error in systeminfo module while calling GetGPU(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo GetGPU(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo memory".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo memory".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_memory_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_memory_subcommand

source: D-Bus error in systeminfo module while calling GetMemory(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo GetMemory(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo drive".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo drive".

source: Can't allocate dbus_ctx_t in systeminfo_module_get_drive_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде systeminfo_module_get_drive_subcommand

source: D-Bus error in systeminfo module while calling GetDrive(): failed to produce a result.
ru: Ошибка D-Bus при обработке результата systeminfo GetDrive(): невозможно получить результат.

source: Internal error in systeminfo module - AlteratorCtlSystemInfoModule *module is NULL in "systeminfo monitor".
ru: Внутренняя ошибка в модуле systeminfo - AlteratorCtlSystemInfoModule *module равен NULL при исполнении команды "systeminfo monitor".
