Repository: dvoropaev/alterator-for-doc
Catalog: subprojects/alteratorctl/po/alteratorctl.po
Languages: ru

source: Not enough parameters for packages repo add subcommand.
ru: Недостаточно параметров для подкоманды packages repo add.

source: Can't allocate dbus_ctx_t in packages_module_repo_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде packages_module_repo_subcommand

source: Error while getting info of packages repo submodule on alterator entry format: result is NULL.
ru: Ошибка при получении информации о packages repo в формате alterator entry: результат равен NULL.

source: Not enough parameters for packages repo remove subcommand.
ru: Недостаточно параметров для подкоманды packages repo remove.

source: Regardless of the forced termination of alteratorctl, apt-get called via D-Bus will continue to run.
ru: Несмотря на принудительное завершение работы alteratorctl, apt-get продолжает работу.

source: Error of register SIGINT signal handler in packages apt submodule.
ru: Не удалось зарегистрировать обработчик сигнала SIGINT в подмодуле packages apt.

source: Internal error in manager module run: *module is NULL.
ru: Внутренняя ошибка модуля manager при исполнении главной логики: *module равен NULL.

source: Internal error in packages module when handle result: module is NULL.
ru: Внутренняя ошибка модуля packages при получении результата: *module равен NULL.

source: Internal error in packages module when handle results: *ctx is NULL.
ru: Внутренняя ошибка модуля packages при получении результата: *ctx равен NULL.

source: Can't validate packages submodule alterator entry. Submodule name is empty.
ru: Не удалось валидировать alterator entry подмодуля packages. Пустое имя подмодуля.

source: Can't get alterator entry data for validation in submodule packages %s: field "%s" is missing.
ru: Невозможно получить данные alterator entry в подмодуле packages %s: пропущено поле "%s".

source: Can't convert empty JSON array to hash table.
ru: Невозможно сконвертировать JSON массив в хэш-таблицу.

source: Can't copy keys of empty hash table to array.
ru: Невозможно скопировать пустые ключи хэш-таблицы в массив.

source: Can't run check install in not existed alterator module.
ru: Невозможно запустить check install в несуществующем модуле alterator.

source: It is not possible to check if an unspecified packages can be installed or removed in packages apt.
ru: Невозможно проверить возможность установки/удаления неуказанных пакетов в подмодуле packages apt.

source: Unable to check if packages can be installed or removed. There is nowhere to save the result.
ru: Невозможно проверить возможность установки/удаления неуказанных пакетов в подмодуле packages apt. Некуда сохранять результат.

source: Can't allcate dbus_ctx_t in get_check_apply_result.
ru: Невозможно выделить dbus_ctx_t в подкоманде get_check_apply_result

source: Wrong type of CheckApply result.
ru: Неизвестный возвращаемый тип данных в packages apt CheckApply.

source: CheckApply error: empty result.
ru: Ошибка CheckApply: пустой результат.

source: Failed to parse JSON result of CheckApply.
ru: Не удалось обработать результат CheckApply в формате JSON.

source: Unable to get approval to review application packages %s for using in packages apt. Accepted flag is null.
ru: Невозможно получить подтверждение установки/удаления пакета %s. Флаг подтверждения равен NULL.

source: Packages to install:
ru: Следующие пакеты будут установлены:

source: Packages to remove:
ru: Следующие пакеты будут удалены:

source: The ability to remove manually installed packages is disabled because it may accidentally remove system-critical packages:
ru: Возможность удаления установленных вручную пакетов отключена, так как в противном случае может произойти случайное удаление важных для работы системы пакетов:

source: Manually installed packages to remove:
ru: Следующие вручную установленные пакеты будут удалены:

source: WARNING: This action may remove packages that are important for the system to function. You must clearly understand the possible consequences!
ru: ВНИМАНИЕ: Данное действие может привести к случайному удалению важных для работы системы пакетов. Вы должны точно понимать возможные последствия!

source: To continue, enter the phrase "Yes, do as I say!".
ru: Введите фразу "Yes, do as I say!" чтобы продолжить.

source: Do you want to continue? [y/N]
ru: Продолжить? [y/N]

source: Aborted.
ru: Прервано.

source: These packages are already installed: %s
ru: Данные пакеты уже установлены: %s

source: These packages aren't installed and cannot be removed: %s
ru: Данные пакеты не установлены и не могут быть удалены: %s

source: Can't run check reinstall package in not existed alterator module.
ru: Невозможно запустить check reinstall package в несуществующем модуле alterator.

source: It is not possible to check if an unspecified package can be reinstalled.
ru: Невозможно проверить возможность переустановки неуказанного пакета.

source: Can't get approving for reinstall package %s. Accepted flag is null.
ru: Невозможно получить подтверждение переустановки пакета %s. Флаг подтверждения равен NULL.

source: Can't allocate dbus_ctx_t in packages_module_apt_check_reinstall_package
ru: Невозможно выделить dbus_ctx_t в подкоманде packages_module_apt_check_reinstall_package

source: It is impossible to get the list of packages to reinstall when reinstalling package %s.
ru: Невозможно получить список переустанавливаемых пакетов при переустановке пакета %s.

source: Wrong type of apt CheckReinstall result.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды apt CheckReinstall.

source: New packages to install:
ru: Следующие НОВЫЕ пакеты будут установлены:

source: D-Bus error in packages rpm files handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата rpm file: невозможно получить результат.

source: Wrong answer type in rpm files.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды rpm files.

source: Error while running rpm Files() method: parameter is NULL.
ru: Ошибка DBus во время работы метода rpm Files(): параметр равен NULL.

source: Error while running rpm Files() method in %s: exit_code is NULL.
ru: Ошибка DBus во время работы метода rpm Files() в %s: код возврата равен NULL.

source: D-Bus error in packages rpm info handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата rpm info: невозможно получить результат.

source: Error in packages rpm submodule: can't get alterator entry data of %s.
ru: Ошибка в подмодуле packages rpm: невозможно получить данные alterator entry %s.

source: D-Bus error in packages rpm install handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата rpm install: невозможно получить результат.

source: Wrong answer type in rpm install.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды rpm install.

source: Error while running rpm Install() method: parameter is NULL.
ru: Ошибка DBus во время работы метода Install(): код возврата равен NULL.

source: Error while running rpm Install() method in %s: exit_code is NULL.
ru: Ошибка DBus во время работы метода Install() в %s: код возврата равен NULL.

source: D-Bus error in packages rpm list handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата rpm list: невозможно получить результат.

source: Wrong answer type in rpm list.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды rpm list.

source: Error while running rpm List() method: exit_code is NULL.
ru: Ошибка DBus во время работы метода List(): код возврата равен NULL.

source: D-Bus error in packages rpm packageinfo handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата rpm packageinfo: невозможно получить результат.

source: Wrong answer type in rpm packageinfo.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды rpm packageinfo.

source: Error while running rpm PackageInfo() method: parameter is NULL.
ru: Ошибка DBus во время работы метода rpm PackageInfo(): код возврата равен NULL.

source: Error while running rpm PackageInfo() method in %s: exit_code is NULL.
ru: Ошибка DBus во время работы метода rpm PackageInfo() в %s: код возврата равен NULL.

source: D-Bus error in packages rpm remove handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата rpm remove: невозможно получить результат.

source: Wrong answer type in rpm remove.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды rpm remove.

source: Error while running rpm Remove() method: parameter is NULL.
ru: Ошибка DBus во время работы метода rpm Remove(): код возврата равен NULL.

source: Error while running rpm Remove() method in %s: exit_code is NULL.
ru: Ошибка DBus во время работы метода rpm Remove() в %s: код возврата равен NULL.

source: D-Bus error in packages apt info handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата apt info: невозможно получить результат.

source: Error in packages apt submodule: can't get alterator entry data of %s.
ru: В модуле packages apt: невозможно получить данные alterator entry объекта %s.

source: D-Bus error in packages apt listall handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата apt listall: невозможно получить результат.

source: Wrong answer type in apt list all packages.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды listall.

source: Error while running apt ListAllPackages() method: exit_code is NULL.
ru: Ошибка DBus во время работы метода apt ListAllPackages(): код возврата равен NULL.

source: D-Bus error in packages apt search handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата apt search: невозможно получить результат.

source: Wrong answer type in apt list all search.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды apt listall.

source: Error while running rpm Search() method: parameter is NULL.
ru: Ошибка DBus во время работы метода apt Search(): код возврата равен NULL.

source: Error while running apt Search() method in %s: exit_code is NULL.
ru: Ошибка DBus во время работы метода apt Search() в %s: код возврата равен NULL.

source: D-Bus error in packages apt last-update handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата apt last-update: невозможно получить результат.

source: Wrong answer type in apt last-update.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды apt last-update.

source: Error while running apt LastUpdate() method: exit_code is NULL.
ru: Ошибка DBus во время работы метода apt LastUpdate(): код возврата равен NULL.

source: D-Bus error in packages repo add handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата repo add: невозможно получить результат.

source: Wrong answer type in repo add.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды repo add.

source: Error while running rpm Add() method: parameter is NULL.
ru: Ошибка DBus во время работы метода repo Add(): код возврата равен NULL.

source: Error while running repo Add() method in %s: exit_code is NULL.
ru: Ошибка DBus во время работы метода repo Add() в %s: код возврата равен NULL.

source: D-Bus error in packages repo info handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата repo info: невозможно получить результат.

source: Error in packages repo submodule: can't get alterator entry data of %s.
ru: Ошибка в модуле packages repo: невозможно получить данные alterator entry объекта %s.

source: D-Bus error in packages repo list handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата repo list: невозможно получить результат.

source: Wrong answer type in repo list.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды repo list.

source: Error while running repo List() method: exit_code is NULL.
ru: Ошибка DBus во время работы метода repo List(): код возврата равен NULL.

source: D-Bus error in packages repo remove handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата repo remove: невозможно получить результат.

source: Wrong answer type in repo remove.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды repo remove.

source: Error while running repo Remove() method in %s: exit_code is NULL.
ru: Ошибка DBus во время работы метода repo Remove() в %s: код возврата равен NULL.

source: alteratorctl packages [OPTIONS] [<SUBMODULE> [COMMAND] [arguments] [OPTIONS]]
ru: alteratorctl packages [ОПЦИИ] [<ПОДМОДУЛЬ> [КОМАНДА] [аргументы] [ОПЦИИ]]

source: Submodules:
ru: Подмодули:

source: apt Runs apt submodule command
ru: apt Запуск команды подмодуля apt

source: repo Runs repo submodule command
ru: repo Запуск команды подмодуля repo

source: rpm Runs rpm submodule command
ru: rpm Запуск команды подмодуля rpm

source: -h, --help Show module packages usage help
ru: -h, --help Отобразить справку модуля packages

source: For more information on a specific submodule and its commands, use: alteratorctl packages <SUBMODULE> (-h | --help)
ru: Для получения дополнительной информации по конкретному подмодулю и его командам используйте: alteratorctl packages <ПОДМОДУЛЬ> (-h | --help)

source: alteratorctl packages rpm <COMMAND> [argument] [OPTIONS]
ru: alteratorctl packages rpm <КОМАНДА> [аргумент] [ОПЦИИ]

source: files <name> Prints files in specified package
ru: files <имя> Отобразить файлы выбранного пакета

source: info Prints submodule info in alterator entry format
ru: info Вывести информацию о подмодуле в формате alterator entry

source: install <path> Install package from rpm file
ru: install <путь> Устанавливает пакет из rpm файла

source: list Prints all installed packages
ru: list Вывести список всех установленных пакетов

source: packageinfo <name> Prints info for specified package
ru: packageinfo <имя> Вывести информацию об указанном пакете

source: remove <name> Remove specified package
ru: remove <имя> Удалить указанный пакет

source: -h, --help Show rpm submodule usage
ru: -h, --help Вызов справки подмодуля rpm

source: alteratorctl packages apt <COMMAND> [argument] [OPTIONS]
ru: alteratorctl packages apt <КОМАНДА> [аргументы] [ОПЦИИ]

source: install <name> Install specified package
ru: install <имя> Установить указанный пакет

source: list Prints all available packages
ru: list Вывести список всех доступных пакетов

source: last-update Loads packages info last update time
ru: last-update Вывести время последнего обновления пакетной базы

source: reinstall <name> Reinstalls specified package
ru: reinstall <имя> Переустановить указанный пакет

source: remove <name> Remove specified package
ru: remove <имя> Удалить указанный пакет

source: search <name> Prints info for specified package
ru: search <имя> Вывести информацию об указанном пакете

source: update Update packages info
ru: update Обновить информацию о пакетах

source: --force-yes Disable confirmation before removing and installing a package. Caution, this action may result in immediate removal of system-critical packages. Use this option only if you fully understand the consequences!
ru: --force-yes Автоматическое подтверждение удаления или установки пакета. Применяйте опцию с осторожностью. Данное действие может привести к немедленному удалению значимых для системы пакетов. Используйте опцию только при полном понимании последствий!

source: -h, --help Show apt submodule usage
ru: -h, --help Вызов справки подмодуля apt

source: alteratorctl packages repo <COMMAND> [argument] [OPTIONS]
ru: alteratorctl packages repo <КОМАНДА> [аргументы] [ОПЦИИ]

source: add <name> Adds repo to sources list
ru: add <имя> Добавить репозиторий в sources list

source: list Prints repos from source list
ru: list Распечатать список репозиториев из sources list

source: remove <name> Removes repo from sources list
ru: remove <имя> Удалить репозиторий из sources list

source: -h, --help Show repo submodule usage
ru: -h, --help Вызов справки подмодуля repo

source: Internal error in packages module while parsing arguments: *iface is NULL.
ru: Внутренняя ошибка модуля packages при обработке аргументов: *iface равен NULL.

source: Wrong arguments in packages module.
ru: Неправильные аргументы модуля packages.

source: Internal error in packages module while parsing arguments: module->commands is NULL.
ru: Внутренняя ошибка модуля packages при обработке аргументов: module->commands равен NULL.

source: Unknown packages submodule.
ru: Неизвестная команда модуля packages.

source: Packages apt submodule options parsing failed: %s
ru: Обработка опций подмодуля packages apt завершилась неудачей: %s

source: Wrong apt arguments.
ru: Неправильные аргументы в подмодуле apt.

source: Wrong packages apt arguments.
ru: Неправильные аргументы подмодуля packages apt.

source: Unknown packages apt module command.
ru: Неизвестная команда подмодуля apt.

source: Wrong rpm arguments.
ru: Неправильные аргументы в подмодуле rpm.

source: Wrong packages rpm files arguments.
ru: Неправильные аргументы подкоманды rpm files.

source: Wrong packages rpm info arguments.
ru: Неправильные аргументы подкоманды packages rpm info.

source: Wrong rpm package_info arguments.
ru: Неправильные аргументы команды package_info подмодуля rpm.

source: Wrong rpm remove arguments.
ru: Неправильные аргументы подкоманды rpm remove.

source: Unknown rpm module command.
ru: Неизвестная команда в подмодуле rpm.

source: Wrong repo arguments.
ru: Неправильные аргументы в подмодуле repo.

source: Wrong repo add files arguments.
ru: Неправильные аргументы подкоманды repo add files.

source: Wrong repo remove info arguments.
ru: Неправильные аргументы подкоманды repo remove info.

source: Unknown repo module command.
ru: Неизвестная команда подмодуля repo.

source: Internal error in get_diag_module: unvaliable id of diag module.
ru: Внутренняя ошибка в get_diag_module: недействительный id модуля diag.

source: The launch of the diag module has failed. Module doesn't exist.
ru: Запуск модуля diag завершился неудачей. Модуль не существует.

source: Can't get display name of diag tool or test %s. Display name data by key %s is empty.
ru: Невозможно получить отображаемое имя диагностического инструмента или теста %s. Полученное отображаемое имя по ключу %s пустое.

source: Can't get alterator entry data for tool %s.
ru: Невозможно получить данные alteratir entry для диагностического инструмента %s.

source: Can't find tests table for tool %s.
ru: Невозможно таблицу с тестами диагностического инструмента %s.

source: Can't find test %s in tool %s.
ru: Невозможно найти тест %s у диагностического инструмента %s.

source: Parsing of diag module arguments failed. Module interface isn't initialized.
ru: Ошибка при обработке аргументов модуля diag. Интерфейс модуля не инициализирован.

source: Wrong arguments in diag module.
ru: Неправильные аргументы модуля diag.

source: Wrong arguments to diag info command.
ru: Неправильные аргументы для команды diag info.

source: Wrong arguments to diag list command.
ru: Неправильные аргументы для команды diag list.

source: Wrong arguments to diag report command.
ru: Неправильные аргументы для команды diag report.

source: Wrong arguments to diag run command.
ru: Неправильные аргументы для команды diag run.

source: Wrong diag module command.
ru: Неправильная команда в модуле diag.

source: alteratorctl diag [COMMAND [args...]] [OPTIONS]
ru: alteratorctl diag [КОМАНДА [аргументы...]] [ОПЦИИ]

source: alteratorctl diag [OPTIONS] List all diagnostic tools
ru: alteratorctl diag [ОПЦИИ] Вывести список всех диагностических инструментов

source: alteratorctl diag <path | name> [OPTIONS] List all test from specified diagnostic tool
ru: alteratorctl diag <путь | имя> [ОПЦИИ] Вывести список всех тестов выбранного диагностического инструмента

source: info <path | name> Print tool info
ru: info <путь | имя> Вывести информацию о выбранном диагностическом инструменте

source: list [path | name] List all diagnostic tools or tool tests (default command)
ru: list [путь | имя] Вывести список диагностических инструментов или тестов выбранного инструмента (команда по умолчанию)

source: report <path | name> <file> Save report to the file with suffix
ru: report <путь | имя> <файл> Сохранить отчёт в файл с суффиксом

source: run <path | name> [test] Run all tests or specified test
ru: run <путь | имя> [тест] Запустить определённый тест или все сразу

source: -a, --all Choise system and session buses
ru: -a, --all Выбрать системную и сессионную шины

source: -v, --verbose Add diagnostic tools paths to diag list output or for enable diag run verbose output
ru: -v, --verbose Добавить к выводу списка диагностических инструментов их пути на DBus

source: -d, --display-name-only Show only diag tools and tests display names
ru: -d, --display-name-only Показать только отображаемые имена диагностического инструмента или теста

source: -D, --no-display-name Show diag tools and tests without display names
ru: -D, --no-display-name Скрыть отображаемые имена диагностических инструментов или тестов

source: -p, --path-only Show only diag tools and tests paths on D-Bus
ru: -p, --path-only Отобразить только пути объектов диагностических инструментов на D-Bus

source: -n, --name-only Show only diag tools and tests names
ru: -n, --name-only Отобразить только имена объектов диагностических инструментов и тестов

source: -N, --no-name Hide diag tools and tests names
ru: -N, --no-name Скрыть отображение имен диагностических инструментов и тестов

source: --session Choise session bus
ru: --session Выбрать сессионную шину

source: --system Choise system bus
ru: --system Выбрать системную шину

source: -h, --help Usage help
ru: -h, --help Вывести справку

source: <<< Info from system bus:
ru: <<< Информация из системной шины:

source: <<< Info from session bus:
ru: <<< Информация из сессионной шины:

source: The call to the diag info method failed. The diag module doesn't exist.
ru: Вызов метода diag info завершился неудачей. Модуль diag не существует.

source: The call to the diag info method failed. Module data is empty.
ru: Вызов метода diag info завершился неудачей. Данные модуля пусты.

source: The call to the diag info method failed. Tool name or path to it's object on D-Bus is empty.
ru: Вызов метода diag info завершился неудачей. Имя инструмента или путь до его объекта на D-Bus пусты.

source: Can't find object %s on system bus or it has invalid interface.
ru: Невозможно найти объект %s на системной шине, либо он имеет невалидный интерфейс

source: Can't find object %s on system or session bus or it has invalid interface.
ru: Невозможно найти объект %s на системной или сессионной шине, либо он имеет невалидный интерфейс

source: Can't get info of tool %s. The tool doesn't exist.
ru: Невозможно получить информацию об инструменте %s. Инструмент не существует.

source: The call to the diag list method failed. The module doesn't exist.
ru: Вызов метода diag list завершился неудачей. Модуль не существует.

source: The call to the diag list method failed. Tool name or path to it's object on D-Bus is empty.
ru: Вызов метода diag list завершился неудачей. Имя инструмента или путь до его объекта на D-Bus пусты.

source: The call to the diag list method failed. Can't get list of tools from object %s on system bus.
ru: Вызов метода diag list завершился неудачей. Невозможно получить список инструментов из объекта %s на системной шине.

source: The call to the diag list method failed. Can't get list of tools from object %s on session bus.
ru: Вызов метода diag list завершился неудачей. Невозможно получить список инструментов из объекта %s на системной шине.

source: The call to the diag list method failed. The context doesn't exist.
ru: Вызов метода diag list завершился неудачей. Пустой контекст.
