Repository: dvoropaev/alterator-for-doc
Catalog: subprojects/alteratorctl/po/alteratorctl.po
Languages: ru

source: Can't create alterator entry info parser in AlteratorGDbusource.
ru: Невозможно создать module info parser в AlteratorGDbusource.

source: DBus error: %s
ru: Ошибка DBus: %s

source: Interface is null in alterator_gdbus_source_get_object_ifaces.
ru: Интерфейс равен null в alterator_gdbus_source_get_object_ifaces.

source: Interface is null in alterator_gdbus_source_get_iface_objects.
ru: Интерфейс равен null в alterator_gdbus_source_get_iface_objects.

source: Wrong path or name of object.
ru: Неправильное имя объекта или его путь.

source: Wrong interface of object.
ru: Неправильный интерфейс объекта.

source: Wrong object method.
ru: Неправильный метод объекта.

source: Internal error in alterator_gdbus_source_set_env_value - AlteratorGDBusSource *source is NULL.
ru: Ошибка DBus в alterator_gdbus_source_set_env_value AlteratorGDBusSource *module равен NULL.

source: Internal error in alterator_gdbus_source_set_env_value - environment variable name is NULL.
ru: Ошибка DBus в alterator_gdbus_source_set_env_value AlteratorGDBusSource *module равен NULL.

source: Internal error in alterator_gdbus_source_set_env_value - environment variable value is NULL.
ru: Ошибка DBus в alterator_gdbus_source_set_env_value AlteratorGDBusSource *module равен NULL.

source: Can't allocate dbus_ctx_t in alterator_gdbus_source_set_env_value
ru: Невозможно выделить dbus_ctx_t в alterator_gdbus_source_set_env_value

source: Internal error in alterator_gdbus_source_get_env_value - AlteratorGDBusSource *source is NULL.
ru: Ошибка DBus в alterator_gdbus_source_get_env_value AlteratorGDBusSource *module равен NULL.

source: Internal error in alterator_gdbus_source_get_env_value - AlteratorGDBusSource **result is NULL.
ru: Ошибка DBus в alterator_gdbus_source_get_env_value AlteratorGDBusSource *module равен NULL.

source: Internal error in alterator_gdbus_source_get_env_value - environment variable name is NULL.
ru: Ошибка DBus в alterator_gdbus_source_get_env_value AlteratorGDBusSource *module равен NULL.

source: Can't allocate dbus_ctx_t in alterator_gdbus_source_get_env_value
ru: Невозможно выделить dbus_ctx_t в alterator_gdbus_source_get_env_value

source: Internal error in alterator_gdbus_source_getobjets_priv - AlteratorCtlEditionsModule *module is NULL
ru: Внутренняя ошибка в alterator_gdbus_source_getobjets_priv - AlteratorCtlEditionsModule *module равен NULL

source: Can't allocate dbus_ctx_t in alterator_gdbus_source_getobjets_priv
ru: Невозможно выделить dbus_ctx_t в alterator_gdbus_source_getobjets_priv

source: DBus error in alterator_gdbus_source_getobjets_priv while calling GetObjects() at the object %s: failed to produce a result.
ru: Ошибка DBus в alterator_gdbus_source_getobjets_priv при вызове GetObjects() на объекте %s: невозможно получить результат.

source: D-Bus error in alterator_gdbus_source_getobjets_priv while calling GetObjects(): failed to produce a result.
ru: Ошибка D-Bus в alterator_gdbus_source_getobjets_priv при вызове GetObjects() невозможно получить результат.

source: Internal error in alterator_gdbus_source_getifaces_priv - AlteratorGDBusSource *module is NULL.
ru: Ошибка DBus в alterator_gdbus_source_getifaces_priv AlteratorGDBusSource *module равен NULL.

source: Object path: %s isn't valid.
ru: Невалидный путь к объекту: %s.

source: Can't allocate dbus_ctx_t in alterator_gdbus_source_getifaces_priv
ru: Невозможно выделить dbus_ctx_t в alterator_gdbus_source_getifaces_priv

source: D-Bus error in alterator_gdbus_source_getifaces_priv while calling GetObjects() at the object %s: failed to produce a result.
ru: Ошибка D-Bus в alterator_gdbus_source_getifaces_priv при вызове GetObjects() на объекте %s: невозможно получить результат.

source: D-Bus error in alterator_gdbus_source_getifaces_priv while calling GetObjects(): failed to produce a result.
ru: Ошибка D-Bus в alterator_gdbus_source_getifaces_priv при вызове GetObjects(): невозможно получить результат.

source: Internal error in alterator_gdbus_source_getsignals_priv - AlteratorGDBusSource *module is NULL.
ru: Внутренняя ошибка в alterator_gdbus_source_getsignals_priv - AlteratorGDBusSource *module равен NULL.

source: Wrong arguments in alterator_gdbus_source_getsignals_priv.
ru: Неправильные аргументы в alterator_gdbus_source_getsignals_priv.

source: Wrong path: %s in alterator_gdbus_source_getsignals_priv.
ru: Некорректный путь: %s в alterator_gdbus_source_getsignals_priv.

source: Can't initialize dbus_ctx in alterator_gdbus_source_getsignals_priv.
ru: Невозможно инициализировать dbus_ctx в alterator_gdbus_source_getsignals_priv.

source: D-Bus error in manager module while calling GetSignals() at the object and interface %s %s and method %s: failed to produce a result.
ru: Ошибка D-Bus при обработке результата manager GetSignals() на объекте, интерфейсе и методе %s %s %s: Невозможно получить результат.

source: Internal error in alterator_gdbus_source_get_services_names - AlteratorGDBusSource *module is NULL.
ru: Ошибка DBus в alterator_gdbus_source_get_services_names AlteratorGDBusSource *module равен NULL.

source: Can't initialize dbus_ctx in alterator_gdbus_source_get_services_names
ru: Невозможно инициализировать dbus_ctx в alterator_gdbus_source_get_services_names

source: D-Bus error in while calling ListNames() at service, the object, interface %s %s %s and method %s: failed to produce a result.
ru: Ошибка D-Bus при обработке результата ListNames() на сервисе, объекте, интерфейсе %s %s %s и методе %s: Невозможно получить результат.

source: Internal error in alterator_gdbus_source_get_introspection - AlteratorGDBusSource *module is NULL.
ru: Внутренняя ошибка в alterator_gdbus_source_get_introspection - AlteratorGDBusSource *module равен NULL.

source: Can't initialize dbus_ctx in alterator_gdbus_source_get_introspection
ru: Невозможно инициализировать dbus_ctx в alterator_gdbus_source_get_introspection.

source: D-Bus error in while calling Introspect() at service, the object, interface %s %s %s and method %s: failed to produce a result.
ru: Ошибка D-Bus при обработке результата Introspect() на сервисе, объекте, интерфейсе %s %s %s и методе %s: Невозможно получить результат.

source: Internal error in alterator_gdbus_source_get_name_by_path - AlteratorGDBusSource *module is NULL.
ru: Внутренняя ошибка в alterator_gdbus_source_get_name_by_path - AlteratorGDBusSource *module равен NULL.

source: Module info parser object wasn't created.
ru: Объект парсера информации о модулях не был создан.

source: Internal error in alterator_gdbus_source_get_path_by_name - AlteratorGDBusSource *module is NULL.
ru: Ошибка DBus в alterator_gdbus_source_get_path_by_name AlteratorGDBusSource *module равен NULL.

source: Module info parser error. Can't get AlteratorCtlGDBusSource.
ru: Ошибка парсера информации о модулях. Невозможно получить AlteratorCtlGDBusSource.

source: Module info parser error. Module iface isn't initialized.
ru: Ошибка парсера информации о модулях. Интерфейс модуля не инициализирован.

source: Can't get child node of empty root.
ru: Невозможно получить дочерний узел пустого корневого элемента.

source: Can't get child node by empty name.
ru: Невозможно получить дочерний узел по пустому имени.

source: Module info parser error. Can't get AlteratorGDBusSource.
ru: Ошибка парсера информации о модулях. Невозможно получить AlteratorCtlGDBusSource.

source: Invalid addres of amount_of_objects in module info parser.
ru: Адрес переменной amount_of_objects не определён.

source: Module info parser error. Module path isn't initialized.
ru: Ошибка парсера информации о модулях. Путь модуля не инициализирован.

source: Can't parse alterator entry info. Can't get alterator entry text.
ru: Невозможно обработать информацию Alterator Entry. Невозможно получить текст alterator entry.

source: Can't parse alterator entry of %s, %s: %s
ru: Невозможно получить данные Alterator Entry %s, %s: %s

source: Module info parser error. alterator entry text is empty.
ru: Ошибка парсера информации о модулях. Пустой текст alterator entry.

source: Can't parse alterator entry.
ru: Невозможно обработать данные alterator entry.

source: Can't get list of objects paths by iface %s in module info parser.
ru: Ошибка. Невозможно получить список объектов по интерфейсу %s в парсере информации о модуле.

source: Can't parse toml file: Uninitialized toml_table_t.
ru: Невозможно получить данные TOML-файла: toml_table_t не инициализирован.

source: Can't parse toml file: GNode **result is NULL.
ru: Невозможно получить данные TOML-файла: GNode **result равен NULL.

source: It is impossible to determine the data type of the value by key %s.
ru: Невозможно определить тип данных значения, записанного по ключу %s.

source: Module info parser error: Module info parser object wasn't created.
ru: Ошибка парсера информации о модулях: Объект парсера информации о модулях не был создан.

source: Module info parser error: No alterator entries data.
ru: Ошибка парсера информации о модулях: Нет данных alterator entry.

source: Module info parser error: Object with path %s and iface %s has no name found.
ru: Ошибка парсера информации о модулях: %s %s .

source: Internal error in get_components_module: unvaliable id of components module.
ru: Ошибка при исполнении get_components_module: недействительный id модуля components.

source: Internal data error in editions module with args: AlteratorCtlEditionsModule *module is NULL.
ru: Внутренняя ошибка в модуле editions при исполнении editions_module_run_with_args - AlteratorCtlEditionsModule *module равен NULL.

source: Internal error in components module run: *module is NULL.
ru: Внутренняя ошибка при исполнении components_module_run - *module равен NULL.

source: Internal error in components module run: *context is NULL.
ru: Внутренняя ошибка при исполнении components_module_run - *context равен NULL.

source: Try to run unknown components module command.
ru: Попытка запуска модуля components с неизвестной командой.

source: The call to the components list method failed. The module doesn't exist.
ru: Вызов метода components list завершился неудачей. Пустой модуль.

source: The call to the components list method failed. The context doesn't exist.
ru: Вызов метода components list завершился неудачей. Пустой контекст.

source: Printing list of components with categories failed. Can't parse categories data.
ru: Не удалось вывести дерево компонентов и категорий. Обработка данных категорий закончилась неудачей.

source: Printing list of components with categories failed. Can't parse components data.
ru: Не удалось вывести дерево компонентов и категорий. Обработка данных компонентов закончилась неудачей.

source: Can,t print components list. Failed to get some component name.
ru: Не удалось вывести список компонентов из-за ошибки получения имени неизвестного компонента.

source: Section %s does not exist.
ru: Раздел %s не существует.

source: Internal error in components module: parameter1 is NULL.
ru: Внутренняя ошибка в модуле components - parameter1 равен NULL.

source: Error while getting info of %s component on alterator entry format.
ru: Ошибка при получении информации о компоненте %s в формате Alterator Entry.

source: Internal error in components module: component name or path is empty.
ru: Внутренняя ошибка в модуле components: имя компонента или путь пусты.

source: Component : %s not installed.
ru: Компонент %s не установлен.

source: Component: %s is already installed.
ru: Компонент %s уже установлен.

source: Internal error in components module: component path or name is empty.
ru: Внутренняя ошибка в модуле components: имя компонента или путь пусты.

source: Component: %s isn't installed.
ru: Компонент %s не установлен.

source: Can't get %s component description: path or name is empty.
ru: Невозможно получить описание компонента %s: имя или путь не заданы.

source: Can't allocate dbus_ctx_t in components_module_description_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде components_module_description_subcommand

source: Can't get description of non-existent %s component: %s.
ru: Невозможно получить описание несуществующего компонента %s: %s.

source: Getting of component %s description failed: %s.
ru: Невозможно получить описание компонента %s: %s.

source: Internal error in components module: path or name is empty.
ru: Внутренняя ошибка в модуле components: имя или путь пусты.

source: Can't get component %s data. Component info parsing failed.
ru: Невозможно получить данные компонента %s. Обработка данных компонента закончилась неудачно.

source: Can't get component %s data. Getting packages list failed.
ru: Невозможно получить данные компонента %s. Не удалось получить список пакетов компонента.

source: Can't get component %s status.
ru: Невозможно получить статус компонента %s.

source: Can't get component %s parent category. Component category is empty.
ru: Невозможно получить данные компонента %s. У компонента не указана категория.

source: Component: %s
ru: Компонент: %s

source: Category: %s
ru: Категория: %s

source: Status: %s
ru: Статус: %s

source: installed
ru: установлен

source: uninstalled
ru: не установлен

source: Component %s has no applicable packages: all were filtered out due to mismatch with the required architecture, localization, or desktop environments specified in the component's alterator entry.
ru: Компонент %s не содержит актуальных пакетов — все они отфильтрованы из‑за несовпадения c текущей архитектурой, локализацией или графическими окружениями, указанными в alterator entry компонента.

source: List of component packages:
ru: Список пакетов, входящих в компонент:

source: Can't search unspecified component.
ru: Невозможно найти неуказанный компонент.

source: Search results:
ru: Результаты поиска:

source: Internal error in components module when handle results: *module or *context is NULL.
ru: Внутренняя ошибка при обработке результата модуля components - *module или *context равны NULL.

source: Can't handle result of unknown command.
ru: Невозможно получить результат неизвестной команды.

source: Module components options parsing failed: %s
ru: Обработка опций модуля components завершилась неудачей: %s

source: It is not possible to use options --installed and --not-installed together.
ru: Нельзя использовать опции --installed и --not-installed вместе.

source: It is not possible to use option --ignore-sections and --sections arguments together.
ru: Нельзя использовать опцию --ignore-sections вместе с параметрами --sections.

source: It is not possible to use options --name-only and --path-only together.
ru: Нельзя использовать опции --name-only и --path-only вместе.

source: It is not possible to use options --name-only and --display-name-only together.
ru: Нельзя использовать опции --name-only и --display-name-only вместе.

source: It is not possible to use options --display-name-only and --path-only together.
ru: Нельзя использовать опции --display-name-only и --path-only вместе.

source: It is not possible to use options --name-only and --path-only and --display-name-only together.
ru: Нельзя использовать опции --name-only, --path-only вместе и -display-name-only вместе.

source: It is not possible to use options --display-name-only and --no-display-name together.
ru: Нельзя использовать опции --display-name-only и --no-display-name вместе.

source: It is not possible to use options --verbose and --display-name-only together.
ru: Нельзя использовать опции --verbose и --display-name-only вместе.

source: It is not possible to use options --verbose and --name-only together.
ru: Нельзя использовать опции --verbose и --name-only вместе.

source: It is not possible to use options --verbose and --path-only together.
ru: Нельзя использовать опции --verbose и --path-only вместе.

source: It is not possible to use options --no-name and --name-only together.
ru: Нельзя использовать опции --no-name и --name-only вместе.

source: It is not possible to use options --no-name and --no-display-name together.
ru: Нельзя использовать опции --no-name и --no-display-name вместе.

source: It is not possible to use options --verbose and --no-name together.
ru: Нельзя использовать опции --verbose и --no-name вместе.

source: It is not possible to use options --preudo-graphic-tree and --simple-tree together.
ru: Нельзя использовать опции --preudo-graphic-tree и --simple-tree вместе.

source: It is not possible to use options --preudo-graphic-tree and --list together.
ru: Нельзя использовать опции --preudo-graphic-tree и --list вместе.

source: It is not possible to use options --simple-tree and --list together.
ru: Нельзя использовать опции --simple-tree и --list вместе.

source: The --enable-display-name option can only be used with the --list option.
ru: Опция --enable-display-name работает только в связке с опцией --list.

source: It is not possible to use options --enable-display-name and --no-display-name together.
ru: Нельзя использовать опции --enable-display-name и --no-display-name вместе.

source: It is not possible to use options --enable-display-name and %s together.
ru: Нельзя использовать опции --enable-display-name и %s вместе.

source: Internal error in components module while parsing arguments: *iface is NULL.
ru: Внутренняя ошибка модуля components при обработке аргументов: *iface равен NULL.

source: Wrong arguments in components module.
ru: Неправильные аргументы в модуле components.

source: Can't initialize context.
ru: Невозможно инициализировать контекст.

source: Wrong arguments to list module command.
ru: Неправильные аргументы для команды list.

source: Wrong arguments to info module command.
ru: Неправильные аргументы для команды info.

source: Wrong arguments to install module command.
ru: Неправильные аргументы команды install module.

source: Wrong arguments to remove module command.
ru: Неправильные аргументы для команды remove.

source: Wrong arguments to description module command.
ru: Неправильные аргументы для отображения описания команд модуля.

source: Wrong arguments to search module command.
ru: Неправильные аргументы для команды search.

source: Wrong arguments to status module command.
ru: Неправильные аргументы для команды status.

source: Wrong components module command.
ru: Неправильная команда в модуле components.

source: Usage:
ru: Использование:

source: alteratorctl components [COMMAND [arguments]] [OPTIONS] [PARAMETERS <args...>]
ru: alteratorctl components [КОМАНДА [аргументы]] [ОПЦИИ] [ПАРАМЕТРЫ <аргументы...>]

source: alteratorctl components List all components in a preudo-graphic tree view
ru: alteratorctl components Вывод всех компонентов в виде дерева с псевдографикой

source: Commands:
ru: Команды:

source: description <component> Prints component description
ru: description <компонент> Вывести описание компонента

source: list [OPTIONS] [PARAMETERS <args...>] List all components (default command)
ru: list [ОПЦИИ] [ПАРАМЕТРЫ <аргументы..>] Вывод всех компонентов с категориями (команда по умолчанию)

source: info <component> Print component info
ru: info <компонент> Вывести информацию о компоненте

source: install <component> Install component
ru: install <компонент> Установить компонент

source: remove <component> Remove component
ru: remove <компонент> Удалить компонент

source: status <component> View the installation status of component
ru: status <компонент> Посмотреть статус установки компонента

source: search <component> Search component by name or path
ru: search <компонент> Найти компонент по имени или пути на D-Bus

source: Parameters:
ru: Параметры:

source: -c, --category <category> Display the list of components of the selected category
ru: -c, --category <категория> Вывести список компонентов выбранной категории

source: -s, --sections <section1> [section2 ...] Display components and categories list from chosen sections
ru: -s, --sections <section1> [section2 ...] Отобразить только выбранные разделы

source: Options for formatting output:
ru: Опции для форматирования вывода:

source: -v, --verbose Add components paths to components list output
ru: -v, --verbose Добавить вывод путей к компонентам на DBus

source: -d, --display-name-only Show only components and categories display names
ru: -d, --display-name-only Показать только отображаемые имена компонентов и категорий

source: -D, --no-display-name Show components and categories without display names
ru: -D, --no-display-name Скрыть отображаемые имена компонентов и категорий

source: -e, --enable-display-name Show components and categories display names in list view
ru: -e, --enable-display-name Показать отображаемые имена компонентов и категорий при выводе в виде списка

source: -p, --path-only Show only components objects paths on D-Bus
ru: -p, --path-only Отобразить только пути к объектам компонентов на D-Bus

source: -n, --name-only Show only components objects names
ru: -n, --name-only Отобразить только имена объектов компонентов

source: -N, --no-name Hide component and category names
ru: -N, --no-name Скрыть отображение имен компонентов и категорий

source: Options for formatting the component list output:
ru: Опции для форматирования вывода списка компонентов:

source: --draft Add draft components and categories to the output
ru: --draft Добавить отображение черновых компонентов

source: -g, --graphic-tree Print components with categories in a preudo-graphic tree view (default option)
ru: -g, --graphic-tree Вывести компоненты с категориями в виде дерева с псевдографикой (выводится по умолчанию)

source: -t, --simple-tree Print components with categories in a simple tree view without display names
ru: -t, --simple-tree Вывести компоненты с категориями в виде простого дерева

source: -l, --list Print components with categories in a list view To printing display name, use the --show-display-name option (valid for --list option only)
ru: -l, --list Вывести компоненты с категориями в виде списка. Для вывода отображаемых имён используйте опцию --show-display-name (её можно использовать лишь в данном представлении вывода)

source: -i, --installed Show only installed components
ru: -i, --installed Отобразить только установленные компоненты

source: -u, --not-installed Show only not installed components
ru: -u, --not-installed Отобразить только неустановленные компоненты

source: -I, --ignore-sections Print all components regardless of edition sections
ru: -I, --ignore-sections Вывести все компоненты игнорируя секции текущей редакции

source: -L, --ignore-legend Hide the description of the component output conventions
ru: -L, --ignore-legend Скрыть описание условных обозначений при выводе компонентов

source: -H, --hide-installation-markers Hide installation status markers of components and categories
ru: -H, --hide-installation-markers Скрыть маркеры со статусом установки компонента/категории

source: Options for installing and removing components:
ru: Опции для установки и удаления компонентов:

source: --force-yes Disable confirmation before removing and installing a component. Caution, this action may result in immediate removal of system-critical packages. Use this option only if you fully understand the consequences!
ru: --force-yes Автоматическое подтверждение удаления или установки компонента. Применяйте опцию с осторожностью. Данное действие может привести к немедленному удалению значимых для системы пакетов. Используйте опцию только при полном понимании последствий!

source: Options for removing components:
ru: Опции для удаления компонентов:
