Repository: dvoropaev/alterator-for-doc
Catalog: subprojects/alteratorctl/po/alteratorctl.po
Languages: ru

source: Internal error: Can't allocate memory for stdout signal.
ru: Внутренняя ошибка: не удалось выделить память для сигнала stdout.

source: Internal error: Can't allocate memory for stderr signal.
ru: Внутренняя ошибка: не удалось выделить память для сигнала stderr.

source: post-configuration
ru: постконфигурации

source: post-deployment
ru: постразвёртывания

source: Can't get deploy status of %s service. The services module doesn't exist.
ru: Невозможно получить состоение сервиса "%s". Модуль services не существует.

source: Can't get deploy status of unknown service. The services module doesn't exist.
ru: Невозможно получить статус неизвестного сервиса. Модуль services не существует.

source: Can't get deploy status of unspecified service.
ru: Нельзя получить состояние неуказанного сервиса.

source: Can't get deploy status of %s service. There is nowhere to save the result.
ru: Невозможно получить статус сервиса "%s". Некуда сохранить результат.

source: Failed to get %s service status. No result of services status command.
ru: Не удалось получить состояние сервиса "%s". Не получен результат команды статус.

source: Can't run services diagnostics tests. *AlteratorCtlServicesModule is NULL.
ru: Невозможно запустить диагностические тесты. *AlteratorCtlServicesModule равен NULL.

source: Unable to run diagnostics tests on unspecified service.
ru: Невозможно запустить диагностические тесты неуказанного сервиса.

source: Can't run diagnostics tests in "%s" service. Service info is empty.
ru: Невозможно запустить диагностические тесты сервиса "%s". Информация о сервисе отсутствует.

source: Empty input params for configure "%s" service.
ru: Не указаны параметры для настройки сервиса "%s".

source: Invalid input json data for run "%s" service diagnostics tests.
ru: Некорректные входные данные в формате Json для запуска диагностических тестов сервиса "%s".

source: Incorrect deploy status of "%s" service.
ru: Некорректное состояние "%s" сервиса.

source: Failed to send parameters to diagnostic tests of "%s" service.
ru: Не удалось отправить параметры для диагностических тестов сервиса "%s".

source: Failed to send %s parameter to diagnostic tests in "%s" service.
ru: Не удалось отправить параметр %s для диагностических тестов сервиса "%s".

source: Failed to set diagnostic regime in "%s" service.
ru: Не удалось установить режим диагностики для сервиса "%s".

source: Failed to run "%s" service diagnostics tests. Invalid tests data.
ru: Не удалось запустить "%s" диагностические тесты сервиса. Некорректные данные тестов.

source: Failed to run "%s" service diagnostics tests. Empty tests data.
ru: Не удалось запустить "%s" диагностические тесты сервиса. Отсутствуют данные тестов.

source: Failed to get tests display names in "%s" diagnostic tool.
ru: Не удалось получить отображаемые имена тестов диагностического инструмента "%s".

source: Can't run non-existent "%s" test in "%s" service.
ru: Невозможно запустить несуществующий тест "%s" у сервиса "%s".

source: Running test "%s"
ru: Запуск теста "%s"

source: Can't get info of unspecified service.
ru: Невозможно получить информацию о неуказанном сервиса.

source: It is not possible to obtain information on a non-existent service.
ru: Нельзя использовать опцию --ignore-sections вместе с параметрами --sections.

source: Services list is empty.
ru: Пустой список сервисов.

source: Error while getting info of
ru: Ошибка при получении информации о

source: on Alterator Entry format.
ru: в формате Alterator entry.

source: Parsing of alterator entry service
ru: Обработка информации в формате Alterator entry сервиса

source: failed.
ru: провалилась.

source: Empty info of service %s in resources command.
ru: Отсутствует информация сервиса "%s" для получения ресурсов.

source: Wrong answer services info type in services resources command.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды services resources.

source: Can't get service %s info result: exit code is empty.
ru: Не получилось получить информацию о сервисе "%s": нет данных о коде возврата.

source: Parsing of service %s information failed.
ru: Не удалось получить информацию о сервисе %s.

source: No resources of service %s.
ru: Нет ресурсов у сервиса "%s".

source: The call to the services status method failed. The module doesn't exist.
ru: Вызов метода services status завершился неудачей. Модуль не существует.

source: Can't get status of unspecified service.
ru: Невозможно статус неуказанного сервиса.

source: Can't allcate dbus_ctx_t in services_module_status_subcommand.
ru: Невозможно выделить dbus_ctx_t в подкоманде services_module_status_subcommand

source: The call to the services start method failed. The module doesn't exist.
ru: Вызов метода services start завершился неудачей. Модуль не существует.

source: Can't start of unspecified service.
ru: Невозможно запустить неуказанный сервис.

source: Empty status of service %s in start command.
ru: Отсутствует статус сервиса "%s" для его запуска.

source: Wrong answer services status type in services start command.
ru: Неизвестный возвращаемый тип данных services status type в команде services start.

source: Can't check service %s status in start command.
ru: Невозможно проверить состояние сервиса "%s" после запуска.

source: Can't start undeployed service %s.
ru: Нельзя запустить неразвёрнутый сервис "%s".

source: Can't start an already running %s service.
ru: Нельзя запустить уже запущенный сервис "%s".

source: Can't allcate dbus_ctx_t in services_module_start_subcommand.
ru: Невозможно выделить dbus_ctx_t в services_module_start_subcommand

source: Service %s doesn't exist.
ru: Service %s не существует.

source: The call to the services stop method failed. The module doesn't exist.
ru: Вызов метода services stop завершился неудачей. Модуль не существует.

source: Can't stop of unspecified service.
ru: Невозможно остановить неуказанный сервис.

source: Empty status of service %s in stop command.
ru: Не удалось получить состояние сервиса "%s" перед его установкой.

source: Wrong answer services status type in services stop command.
ru: Неизвестный возвращаемый тип данных services status type в команде services stop.

source: Can't check service %s status in stop command.
ru: Не удалось получить состояние сервиса "%s" в команде stop.

source: Can't stop a %s service that is not running.
ru: Невозможно остановить незапущенный сервис "%s".

source: Can't allcate dbus_ctx_t in services_module_stop_subcommand.
ru: Невозможно выделить dbus_ctx_t в подкоманде services_module_stop_subcommand

source: Internal error in services module when handle result: module is NULL.
ru: Внутренняя ошибка модуля services при получении результата: *module равен NULL.

source: Internal error in services module when handle results: *ctx is NULL.
ru: Внутренняя ошибка модуля services при получении результата: *ctx равен NULL.

source: Can't backup of unspecified service.
ru: Невозможно создать резервную копию неуказанного сервиса.

source: DBus error in service %s backup.
ru: Ошибка D-Bus при исполнении команды services %s backup.

source: Wrong answer type in backup of %s service.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды services %s backup.

source: Can't get service %s backup result: exit code is empty.
ru: Не получилось получить результат команды services backup %s: нет данных о коде возврата.

source: Failed to backup %s service. Exit code: %i.
ru: Не удалось создать резервную копию сервиса "%s". Код возврата: %i.

source: Can't configure of unspecified service.
ru: Невозможно настроить неуказанный сервис.

source: DBus error in service %s configure.
ru: Ошибка D-Bus при исполнении команды services %s configure.

source: Wrong answer type in configure of %s service.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды services сonfigure %s.

source: Can't get service %s configure result: exit code is empty.
ru: Не получилось получить результат команды services %s configure: нет данных о коде возврата.

source: Failed to configure %s service. Exit code: %i.
ru: Не удалось настроить сервис %s. Код возврата: %i.

source: Can't deploy unspecified service.
ru: Невозможно развернуть неуказанный компонент.

source: Empty result of deploy %s service command.
ru: Пустой результат команды services deploy %s.

source: Wrong answer type in deploy of %s service.
ru: Неизвестный возвращаемый тип данных после исполнения команды services deploy %s.

source: Can't get service %s deploy result: exit code is empty.
ru: Не получилось получить результат команды services deploy %s: нет данных о коде возврата.

source: Failed to deploy service '%s'. Exit code: %i.
ru: Не удалось развернуть сервис '%s'. Код возврата: %i

source: No exit code from %s service autolaunch after deploying.
ru: Не получен код возврата после автозапуска сервиса "%s" после развёртывания.

source: Wrong answer services start type in services deploy command.
ru: Неизвестный возвращаемый тип данных после исполнения команды services deploy.

source: Failed to start %s service after deploying. Exit code: %i.
ru: Не удалось запустить сервис "%s" после развёртывания. Код возврата: %i.

source: Empty info of service %s.
ru: Не удалось получить информацию о сервисе "%s".

source: Wrong answer type in %s service info.
ru: Неизвестный возвращаемый тип данных после исполнения services info %s.

source: Can't restore of unspecified service.
ru: Невозможно восстановить неуказанный сервис.

source: DBus error in service %s restore.
ru: Ошибка D-Bus при исполнении команды services restore %s.

source: Wrong answer type in restore of %s service.
ru: Неизвестный возвращаемый тип данных после исполнения команды services restore %s.

source: Can't get service %s restore result: exit code is empty.
ru: Не получилось результат команды service restore %s: нет данных о коде возврата.

source: Failed to restore %s service. Exit code: %i.
ru: Не удалось восстановить сервис '%s'. Код возврата: %i

source: Unknown parameter value type.
ru: Неизвестный тип параметра.

source: Enum value '%s' is not defined in schema for '%s'.
ru: Значение перечисления '%s' не определено в схеме для '%s'.

source: Internal error: can't resolve properties for '%s'.
ru: Внутренняя ошибка: не удаётся определить свойства для '%s'.

source: Parameter data not found for %s.
ru: Данные параметра не найдены для %s.

source: Can't get required params paths. Unknown service name.
ru: Невоможно получить пути обязательных параметров. Неизвестное имя сервиса.

source: Can't get required params paths. Unknown service "%s" context.
ru: Невоможно получить пути обязательных параметров. Неизвестный контекст сервиса "%s".

source: Can't get required params paths of "%s %s". There is nowhere to save the result.
ru: Невозможно получить пути требуемых параметров для "%s %s". Некуда сохранить результат.

source: DBus error in service %s status.
ru: Ошибка D-Bus при исполнении команды services status %s.

source: Service %s is undeployed
ru: Сервис "%s" не развёрнут.

source: Service %s is deployed, but not launched
ru: Сервис "%s" развёрнут, но не запущен.

source: Service %s is deployed and running
ru: Сервис "%s" развёрнут и запущен

source: Unknown status of %s service: %i
ru: Неизвестный статус сервиса "%s": %i

source: DBus error in service %s start.
ru: Ошибка D-Bus при исполнении команды services start %s.

source: Wrong answer type in start of %s service.
ru: Неизвестный возвращаемый тип данных после исполнения команды services start %s.

source: Can't get service %s start result: exit code is empty.
ru: Не получилось результат команды service start %s: нет данных о коде возврата.

source: Failed to start %s service. Exit code: %i.
ru: Невозможно запустить сервис %s. Код возврата: %i

source: DBus error in service %s stop.
ru: Ошибка D-Bus при исполнении команды services stop %s.

source: Wrong answer type in stop of %s service.
ru: Неизвестный возвращаемый тип данных после исполнения команды services stop %s.

source: Can't get service %s stop result: exit code is empty.
ru: Не получилось результат команды service stop %s: нет данных о коде возврата.

source: Failed to stop %s service. Exit code: %i.
ru: Невозможно остановить сервис %s. Код возврата: %i.

source: Can't undeploy unspecified service.
ru: Невозможно деактивировать неуказанный сервис.

source: Empty result of undeploy %s service command.
ru: Пустой результат в команде services undeploy %s.

source: Wrong answer type in uneploy of %s service.
ru: Неизвестный возвращаемый тип данных после исполнения команды services undeploy %s.

source: Can't get service %s undeploy result: exit code is empty.
ru: Не получилось результат команды services undeploy %s: нет данных о коде возврата.

source: Failed to undeploy %s service. Exit code: %i.
ru: Не удалось деактивировать сервис "%s". Код возврата: %i.

source: Can't get json params via "status" command. empty service name.
ru: Невозможно получить параметры неуказанного сервиса с помощью команды status.

source: Can't get json params via "status" command. Nowhere to save the result.
ru: Невозможно получить параметры в Json формате с помощью команды "status". Некуда сохранить результат.

source: Can't get service "%s" status: error %i.
ru: Не удалось получить статус сервиса "%s": код возврата %i.

source: Invalid json data.
ru: Некорректные Json данные.

source: alteratorctl services [OPTIONS] List services
ru: alteratorctl services [ОПЦИИ] Вывод списка сервисов

source: alteratorctl services [COMMAND] [OPTIONS] [PARAMETERS <argument>] [service]
ru: alteratorctl services [КОМАНДА] [ОПЦИИ] [ПАРАМЕТРЫ <аргументы>] [сервис]

source: list List services (default command)
ru: list Вывести список сервисов (команда по умолчанию)

source: status <service> Get current state and parameters of specified service
ru: status <сервис> Получить текущее состояние и параметры указанного сервиса

source: info <service> Get info about specified service
ru: info <сервис> Вывести информацию о выбранном сервисе

source: resources <service> Show resources of specified service
ru: resources <сервис> Вывести ресурсы указанного сервиса

source: play <file> Deploy service using parameters from JSON file exported from Alt-Services
ru: play <файл> Развернуть сервис, используя параметры из JSON-файла, экспортированного из Alt-Services

source: diagnose <service> (<diagnostic tool> [test...])... [PARAMETERS] Run diagnostics tests for specified service
ru: diagnose <сервис> (<диагностический инструмент> [тест...])... [ПАРАМЕТРЫ] Запустить диагностические тесты указанного сервиса

source: deploy <service> [PARAMETERS] Deploy specified service
ru: deploy <сервис> [ПАРАМЕТРЫ] Развернуть указанный сервис

source: configure <service> <PARAMETERS> Configure specified service
ru: configure <сервис> <ПАРАМЕТРЫ> Настроить указанный сервис

source: start <service> Start service
ru: start <сервис> Запустить указанный сервис

source: stop <service> Stop service
ru: stop <сервис> Остановить указанный сервис

source: backup <service> [PARAMETERS] Backup specified service
ru: backup <сервис> [ПАРАМЕТРЫ] Создать резервную копию указанного сервиса

source: restore <service> [PARAMETERS] Restore specified service
ru: restore <сервис> [ПАРАМЕТРЫ] Восстановить указанный сервис

source: undeploy <service> [PARAMETERS] Undeploy specified service
ru: undeploy <сервис> [ПАРАМЕТРЫ] Деактивировать указанный сервис

source: -v, --verbose Add services paths to services list output
ru: -v, --verbose Добавить к списку сервисов пути к их объектам на D-Bus

source: -d, --display-name-only Show only services display names
ru: -d, --display-name-only Показать только отображаемые имена сервисов

source: -D, --no-display-name Show services without display names
ru: -D, --no-display-name Скрыть отображаемые имена сервисов

source: -p, --path-only Show only services objects paths on D-Bus
ru: -p, --path-only Отобразить только пути объектов сервисов на D-Bus

source: -n, --name-only Show only services objects names
ru: -n, --name-only Отобразить только имена объектов сервисов

source: -a, --all Run all diagnostics tests of current mode (pre-diagnostic or post-diagnostic)
ru: -a, --all Запустить все диагностические тесты текущего режима (пред- и постдиагностика)

source: -s, --autostart Start the service immediately after deployment
ru: -s, --autostart Запустить сервис сразу после развёртывания

source: -E, --except-status-markers Show services list without deploy and running state markers
ru: -E, --except-status-markers Отобразить список сервисов без указания их состояния

source: -N, --no-name Hide services names
ru: -N, --no-name Скрыть имена сервисов

source: -H, --hide-markers-legend Hide the legend of status tokens
ru: -H, --hide-markers-legend Скрыть легенду с обозначениями маркеров состояния сервисов

source: -h, --help Show services module usage help
ru: -h, --help Вызов справки модуля services

source: The service %s doesn't exist.
ru: Сервис %s не существует.

source: Service %s has no interface %s.
ru: Service %s не содержит интерфейс %s.

source: Error when checking if an service: %s has an interface %s.
ru: Ошибка при проверке наличия у сервиса %s интерфейса %s.

source: Can't get display name of service %s. Parsing of service data failed.
ru: Невозможно получить отображаемое имя сервиса %s. Обработка данных сервиса закончилась неудачно.

source: Can't get display name of service %s. Display name data by key %s is empty.
ru: Невозможно получить отображаемое имя service %s. Полученное отображаемое имя по ключу %s пустое.

source: Can't get status %s service result: invalid variable for saving the result.
ru: Невозможно получить результат получения статуса сервиса "%s": некуда сохранить результат.

source: Wrong answer type in %s service status.
ru: Неизвестный возвращаемый тип данных команды services status %s.

source: Can't get service %s status result: exit code is empty.
ru: Не получилось получить информацию о сервисе %s: нет данных о коде возврата.

source: Service '%s' returned invalid status: %s (%s, %d).
ru: Сервис '%s' вернул некорректный статус: %s (%s, %d).

source: Can't get text of unspecified json parameters of %s service.
ru: Невозможно получить текст неуказанных параметров Json для сервиса %s.

source: not deployed
ru: не развёрнут

source: deployed, stopped
ru: развёрнут, остановлен

source: deployed, running
ru: развёрнут, запущен

source: unknown status
ru: неизвестное состояние

source: Status legend:
ru: Обозначения состояний:

source: Name
ru: Имя

source: Value
ru: Значение

source: Can't save %s service resources to unvaliable container.
ru: Некуда сохранить ресурсы сервиса "%s".

source: Can't get service %s data for resources output.
ru: Невозможно получить данные сервиса "%s" для вывода информации о его ресурсах.

source: Can't print resources of service %s: empty service info.
ru: Невозможно вывести ресурсы сервиса "%s": нет информации о сервисе.

source: Can't get non-existance value of resource %s in %s service.
ru: Невозможно получить несуществующее значение ресурса "%s" сервиса "%s".

source: Failed of getting resource "%s" linked param: it isn't json simple value type.
ru: Не удалось получить значение параметра, связанного с ресурсом "%s": он должен быть простого типа.

source: Can't get required TCP flag of port resource %s in %s service.
ru: Невозможно получить требуемый флаг TCP для ресурса "%s" сервиса "%s".

source: Can't get required UDP flag of port resource %s in %s service.
ru: Невозможно получить требуемый флаг UDP для ресурса "%s" сервиса "%s".

source: Comment: %s
ru: Комментарий: %s

source: Param: %s (%s)
ru: Параметр: %s (%s)

source: Param comment: %s
ru: Комментарий параметра: %s

source: Can't get initial parameters of unspecified service.
ru: невозможно получить параметры по умолчанию неуказанного сервиса.

source: Can't get service %s default value's.
ru: Не удалось получить значения по умолчанию сервиса "%s".

source: Can't get initial params with empty info of %s service.
ru: Невозможно получить параметры сервиса %s: отсутствует информация о нём.

source: No service %s initial parameters info.
ru: Нет информации о параметрах по умолчанию сервиса "%s".

source: Incorrect key 'required' type in '%s' alterator entry.
ru: Некорретный тип ключа 'required' указан в alterator entry сервиса '%s'.

source: Failed to get enum fields of "%s" array elements.
ru: Не удалось получить поле перечисления "%s" - элемента массива.

source: Failed to get enum fields of "%s" array element with index %lu.
ru: Не удалось получить поля перечисления элемента массива "%s" с индексом %lu.

source: No service %s resources info.
ru: Нет информации о ресурсах сервиса "%s".

source: No service %s context usage of %s parameter.
ru: Нет контекста параметра "%s" сервиса "%s".

source: Invalid json data of service %s to update current data.
ru: Некорректные данные сервиса "%s" для обновления текущих данных.

source: Empty status of service %s in getting list of deployed services.
ru: Пустой статус сервиса "%s" при получениии списка развёрнутых сервисов.

source: Wrong answer services status type in getting list of deployed services.
ru: Получен статус сервиса с некорректным типом данных при получении списка развёрнутых сервисов.

source: Failed to determine service '%s' state.
ru: Не удалось определить состоение сервиса "%s"

source: Can't get service %s deploy status. Unspecified service status context.
ru: Невозможно получить состояние сервиса "%s". Не удалось создать контекст статуса.

source: Can't get service %s status.
ru: Невозможно получить статус сервиса "%s".

source: Can't get diagnostic tests of "%s" service. The services module doesn't exist.
ru: Невозможно получить диагностические тесты сервиса "%s". Модуль services не существует.

source: Can't get diagnostic tests of unknown service. The services module doesn't exist.
ru: Невозможно получить диагностические тесты неизвестного сервиса. Модуль services не существует.

source: Can't get diagnostic tests of unspecified service.
ru: Невозможно получить диагностические тесты неизвестного сервиса.

source: Can't get diagnostic tests. No service "%s" alterator entry.
ru: Невозможно получить диагностические тесты, отсутствует информация о сервисе "%s".

source: Can't get diagnostic tests of "%s" service. There is nowhere to save the result.
ru: Невозможно получить список диагностических тестов сервиса "%s". Некуда сохранить результат.

source: Failed to get "%s" service D-Bus interfaces.
ru: Не удалось получить D-Bus интерфейсы сервиса "%s".

source: Can't get test list of "%s" service: failed of getting diag tools info.
ru: Невозможно получить список диагностических тестов сервиса "%s": не удалось получить информацию о диагностических инструментов.

source: Can't get test list of "%s" service "%s" diag tool with unspecified DBus path.
ru: Не удалось получить список тестов диагностического инструмента сервиса "%s" - "%s" при неуказанном пути D-Bus.

source: Can't get test list of "%s" service "%s" diag tool with invalid DBus path.
ru: Не удалось получить список тестов диагностического инструмента сервиса "%s" - "%s" при некорректном пути D-Bus.

source: Can't get test list of "%s" service "%s" diag tool with unspecified bus type.
ru: Не удалось получить список тестов диагностического инструмента сервиса "%s" - "%s" при неуказанном типе шины D-Bus.

source: Can't get test list of "%s" service: "%s" diag tool has invalid bus type.
ru: Не удалось получить список тестов диагностического инструмента сервиса "%s" - "%s". Указан некорректный тип шины D-Bus инструмента.

source: Failed to get "%s" diag tool tests info.
ru: Не удалось получить диагностические инструменты сервиса "%s".

source: No diagnostic tests in diagnostic tool "%s" of "%s" service.
ru: Нет тестов у диагностического инструмента "%s" сервиса "%s".
