Repository: dvoropaev/alterator-for-doc
Catalog: subprojects/alteratorctl/po/alteratorctl.po
Languages: ru

source: --allow-remove-manually Allow removal of manually installed packages. Enabling this option may lead to the removal of packages required for proper system operation
ru: --allow-remove-manually Разрешить удаление установленных вручную пакетов. Использование этой опции может привести к случайному удалению пакетов, необходимых для работы системы

source: -b, --allow-remove-base Allow removing of packages which contains in base components
ru: -b, --allow-remove-base Разрешить удаление пакетов, содержащихся в базовых компонентах

source: Options for package base synchronization:
ru: Опции синхронизации с пакетной базой:

source: --no-update Don't update the package lists before installing or uninstalling a components
ru: --no-update Не обновлять списки пакетов перед установкой или удалением компонентов

source: Usage help:
ru: Справка:

source: -h, --help Show module components usage
ru: -h, --help Вызов справки модуля components

source: The term "base components" is applicable only if a product edition is installed. Base components are those assigned to the section of the same name in the current edition. By default, removing base components is prohibited, as is removing any component that includes packages from any base component. Use the --allow-remove-base option to allow such removals. "Manually installed" packages are those marked as manual by the apt system. This means the package was installed explicitly by the user. You can get a list of such packages by running the command apt-mark showmanual. This list contains many packages essential to system operation. Therefore, their removal is prohibited by default. To remove components including these packages, use the --allow-remove-manually option. Keep in mind that removing such components may disrupt your system. Use this option only if you fully understand the consequences!
ru: Термин "базовые компоненты" применим только в случае наличия установленной редакции. Под базовыми компонентами подразумеваются компоненты, относящиеся к одноимённому разделу текущей редакции. По умолчанию удаление базовых компонентов запрещено, равно как и удаление компонентов, содержащих пакеты, входящие в любой базовый компонент. Для удаления таких компонентов используйте опцию --allow-remove-base. "Установленные вручную" пакеты — это пакеты, помеченные системой apt как manual. Данная метка означает, что пакет был установлен вручную. Получить список таких пакетов можно, выполнив команду apt-mark showmanual. Этот список содержит множество важных для работы системы пакетов, поэтому их удаление по умолчанию запрещено. Для удаления компонентов, включающих такие пакеты, используйте опцию --allow-remove-manually. Помните, что удаление подобных компонентов может нарушить работоспособность системы. Используйте эту опцию только при полном понимании возможных последствий!

source: Internal error in components module: component_str_id is NULL.
ru: Внутренняя ошибка в модуле components - component_str_id равен NULL.

source: Error in component module: can't get alterator entry data of component %s.
ru: Ошибка в модуле components: невозможно получить данные alterator entry объекта %s.

source: Can't handling the result od description method: component path or name is empty.
ru: Не удалось получить результат метода description: имя или путь компонента не заданы.

source: Component %s description is empty.
ru: Описание компонента %s отсутствует.

source: Wrong answer type in components description.
ru: Неправильный тип данных описания компонента.

source: Handling of component %s description failed. Exit code uninitialized.
ru: Не удалось получить описание компонента %s. Нет данных о коде возврата.

source: Category %s not found.
ru: Категория %s не найдена.

source: Category %s not found: %s is a component, not a category.
ru: Категория %s не найдена: %s — это имя компонента.

source: Notations:
ru: Обозначения:

source: %s Installed
ru: %s Установлен(а)

source: %s Uninstalled
ru: %s Не установлен(а)

source: %s Partially installed
ru: %s Частично установлен(а)

source: %s Draft item (--draft) or unknown installation status
ru: %s Черновой элемент (--draft) или неизвестный статус установки

source: Can't get sections with components: editions module isn't registered.
ru: Невозможно получить секции с компонентами: модуль editions не существует.

source: Can't get current arch: systeminfo module isn't registered.
ru: Невозможно получить текущую архитектуру системы: модуль systeminfo не зарегистрирован.

source: Can't get current locales list: systeminfo module isn't registered.
ru: Невозможно получить локализацию(и) пользователя(ей): модуль systeminfo не зарегистрирован.

source: Getting system languages failed: empty languages list.
ru: Информация о локалях отсутствует.

source: Can't get desktop environments: systeminfo module isn't registered.
ru: Невозможно получить графическое окружение системы: модуль systeminfo не зарегистрирован.

source: Failed to get current arch.
ru: Не удалось получить архитектуру системы.

source: Can't get kernel kflavour.
ru: Невозможно получить имя ядра.

source: Printing list of components with categories failed.
ru: Не удалось вывести дерево компонентов и категорий.

source: Incorrect data was passed to update the installation status of components and categories.
ru: Были переданы неверные данные для обновления статуса установки компонентов и категорий.

source: Incorrect data was transmitted to filter out components that not installed.
ru: Были переданы неверные данные для отсеивания неустановленных компонентов.

source: Incorrect data was transmitted to filter out components that installed.
ru: Были переданы неверные данные для отсеивания установленных компонентов.

source: Can't get alterator entry data for validation in module components: field "%s" is missing.
ru: Невозможно получить данные alterator entry в модуле components: отсутствует поле "%s".

source: Can't get alterator entry data for validation in module components: table "%s" is missing.
ru: Невозможно получить данные alterator entry в модуле components: отсутствует таблица "%s".

source: Can't get alterator entry data for validation component category info: field "%s" is missing.
ru: Невозможно получить данные alterator entry в модуле components: пропущено поле "%s".

source: Can't get category info. Category name is empty.
ru: Не удалось получить информацию о категории. Пустое имя категории.

source: Can't allocate dbus_ctx_t in components_module_get_category_info.
ru: Невозможно выделить dbus_ctx_t в components_module_get_category_info.

source: Failed call category info from non-existent object: %s.
ru: Невозможно получить информацию о категории из неизвестного объекта: %s.

source: Failed to get component category info: %s.
ru: Не удалось получить информацию о мониторе: %s.

source: Can't allocate dbus_ctx_t in components_module_get_categories_info.
ru: Невозможно выделить dbus_ctx_t в components_module_get_categories_info.

source: Failed call get all categories info from non-existent object: %s.
ru: Невозможно получить информацию обо всех категориях из неизвестного объекта: %s.

source: Failed to get all categories info: %s.
ru: Не удалось получить информацию обо всех категориях:

source: Can't allocate dbus_ctx_t in components_module_categories_list
ru: Невозможно выделить dbus_ctx_t в components_module_categories_list

source: Failed to get components categories list via non-existing object %s.
ru: Не удалось получить список категорий компонентов с помощью несуществующего объекта %s.

source: Failed to get components categories list: %s.
ru: Не удалось получить список категорий компонентов: %s

source: Components list is empty.
ru: Список компонентов пуст.

source: Can't find parent category %s for category %s.
ru: Не удалось найти родительскую категорию %s категории %s.

source: Can't find parent category %s for component %s.
ru: Не найдена категория компонента %s.

source: Can't get display name of component %s. Parsing of component data failed.
ru: Невозможно получить отображаемое имя компонента %s. Обработка данных компонента закончилась неудачно.

source: Can't get display name of %s category. Getting of category alterator entry failed.
ru: Невозможно получить отображаемое имя категории %s. Не удалось получить информацию alterator entry о выбранной категории.

source: Can't get display name of %s category. Parsing of category data failed.
ru: Невозможно получить отображаемое имя категории %s. Обработка данных категории закончилась неудачно.

source: Can't get display name of component %s. Display name data by key %s is empty.
ru: Невозможно получить отображаемое имя компонента %s. Полученное отображаемое имя по ключу %s пустое.

source: Finding section display name failed.
ru: не удалось найти отображаемое имя секции.

source: Can't allocate dbus_ctx_t in components_module_get_components_info.
ru: Невозможно выделить dbus_ctx_t в подкоманде components_module_get_components_info.

source: Getting of non-existing component info failed.
ru: Не удалось получить информацию о несуществующем компоненте.

source: Cat'n get component status by empty uninstalled packages list.
ru: Невозможно получить статус компонента по пустому списку неустановленных пакетов.

source: Can't get installed status of empty component.
ru: Невозможно получить статус установки пустого компонента.

source: No variable defined to save the installation status of the component.
ru: Нет переменной для сохранения статуса установки.

source: Can't get packages list of component %s.
ru: Невозможно получить список пакетов компонента: %s.

source: The object %s doesn't exist.
ru: Объект %s не существует.

source: Can't allocate dbus_ctx_t in components_module_get_components_uninstalled_packages.
ru: Невозможно выделить dbus_ctx_t в подкоманде components_module_get_components_uninstalled_packages.

source: Getting of components batch status failed: %s.
ru: Невозможно обработать статус всех компонентов: %s.

source: Can't parse alterator entry in components module: %s
ru: Невозможно получить alterator entry модуля components: %s

source: Can't get value packages names.
ru: Невозможно получить имена пакетов.

source: Packages module isn't registered.
ru: Модуль packages не зарегистрирован.

source: Error exit code from rpm list method.
ru: Ошибка получения кода возврата метода list.

source: Internal error in components module - remove installed packages.
ru: Внутренняя ошибка в модуле components - удаление установленных пакетов.

source: Internal data error in components module with args: AlteratorCtlComponentsModule *module is NULL in "components remove".
ru: Внутренняя ошибка в модуле components c аргументами - AlteratorCtlComponentsModule *module равен NULL в "components remove".

source: Apt update failed with exit code: %i
ru: Apt update закончился неудачей: код возврата %i.

source: Internal error in components module - install component packages.
ru: Внутренняя ошибка в модуле components - установка пакета в компонент.

source: No packages to install.
ru: Пакет не установлен.

source: Error exit code from apt install method: %i.
ru: Ошибка выполнения подкоманды apt install. Код возврата %i.

source: Internal error in components module - AlteratorCtlComponentsModule *module is NULL in "components status".
ru: Внутренняя ошибка в модуле components - AlteratorCtlEditionsModule *module равен NULL при исполнении команды "components status".

source: Internal error in components module - path to component is NULL in "components status".
ru: Внутренняя ошибка в модуле components - путь к компоненту равен NULL при исполнении команды "components status".

source: Internal error in components module - status is NULL in "components status".
ru: Внутренняя ошибка в модуле components - status равен NULL при исполнении команды "components status".

source: Error when checking the presence of an object on D-Bus.
ru: Ошибка проверки наличия объекта на D-Bus.

source: Object %s isn't found on D-Bus.
ru: Объект %s не найден в D-Bus.

source: Error when checking if an object: %s has an interface %s.
ru: Ошибка при проверке наличия у объекта %s интерфейса %s.

source: Object %s has no interface %s.
ru: У объекта %s отсутствует интерфейс %s.

source: Can't allocate dbus_ctx_t in component_module_get_component_status.
ru: Невозможно выделить dbus_ctx_t в подкоманде component_module_get_component_status.

source: D-Bus error in components module while calling Status(): failed to produce a result in component: %s.
ru: Ошибка D-Bus при обработке результата components Status(): невозможно получить результат компонента: %s.

source: Can't remove %s component. The component contains packages on base components packages:
ru: Невозможно удалить компонент %s, так как он содержит в себе следующие пакеты, имеющиеся в базовых компонентах системы:

source: Internal error in components getting installed packages: path or name is empty.
ru: Внутренняя ошибка при получении установленных пакетов: имя или путь пусты.

source: Can't get component %s installed packages. Component info parsing failed.
ru: Невозможно получить установленные пакеты компонента %s. Обработка информации о компоненте закончилась неудачно.

source: Can't get component %s installed packages. Getting packages list failed.
ru: Невозможно получить список установленных пакетов компонента %s. Получение списка закончилось неудачно.

source: Can't get component %s installed packages.
ru: Невозможно получить установленные пакеты компонента %s.

source: Component %s already installed.
ru: Компонент %s уже установлен.

source: Component %s not installed.
ru: Компонент %s не установлен.

source: Internal error in components module - AlteratorCtlComponentsModule *module is NULL in "components remove".
ru: Внутренняя ошибка в модуле components - AlteratorCtlEditionsModule *module равен NULL при исполнении команды "components remove".

source: No packages to remove.
ru: Нет пакетов для удаления .

source: Error exit code from apt remove method: %i.
ru: Ошибка выполнения подкоманды apt remove. Код возврата %i.

source: Failed to calculate affected components for unknown action with unspecified component.
ru: Не удалось рассчитать затронутые компоненты для неизвестного действия с неизвестным компонентом.

source: Failed to calculate affected components for %s of unspecified component.
ru: Не удалось рассчитать затронутые компоненты при %s неизвестного компонента.

source: remove
ru: удаления

source: install
ru: установки

source: Failed to calculate affected components for unknown action with component %s.
ru: Не удалось рассчитать затронутые компоненты для неизвестного действия с компонентом %s.

source: Failed to calculate affected components for %s of component %s.
ru: Не удалось рассчитать затронутые компоненты для %s компонента %s.

source: Failed to calculate affected components for %s of component %s. Get empty packages list of %s component.
ru: Не удалось рассчитать затронутые компоненты при %s компонента %s. Нет информации о пакетах, входящих в компонент %s.

source: Failed to calculate affected components for %s of component %s. Result variable is NULL.
ru: Не удалось рассчитать затронутые компоненты при %s компоненты %s. Не выделена память для сохранения результата.

source: Failed to calculate affected components for %s of component %s. Components alterator entry info is empty.
ru: Не удалось рассчитать затронутые компоненты для %s компонента %s. Информация о компонентах в виде alterator entry отсутствует.

source: Failed to calculate affected components for %s of component %s. Can't get uninstalled packages list.
ru: Не удалось рассчитать затронутые компоненты для %s компонента %s. Не удалось получить список неустановленных пакетов, относящихся к компонентам.

source: Failed to calculate affected components for %s of component %s. Can't get packages list of component %s.
ru: Не удалось рассчитать затронутые компоненты при %s компонента %s. Не удалось получить список пакетов компонента %s.

source: Failed to print affected components for unknown action with unspecified component.
ru: Не удалось вывести затронутые компоненты для неизвестного действия с неизвестным компонентом.

source: Failed to print affected components for %s of unspecified component.
ru: Не удалось вывести затронутые компоненты при %s компонента %s.

source: Failed to print affected components for unknown action with component %s.
ru: Не удалось вывести затронутые компоненты для неизвестного действия с компонентом %s.

source: Failed to print affected components for %s of component %s.
ru: Не удалось распечатать затронутые компоненты при %s компонента %s.

source: Failed to print affected components for %s of component %s. Empty list of packages to install and to remove.
ru: Не удалось распечатать затронутые компоненты при %s компонента %s. Получен пустой список пакетов для удаления или установки компонента.

source: Failed to print affected components for %s of component %s. Error from getting of packages to install and to remove. Exit code: %i.
ru: Не удалось распечатать затронутые компоненты при %s компонента %s. Ошибка получения устанавливаемых и удаляемых пакетов. Код возврата: %i.

source: Components to install:
ru: Следующие компоненты будут установлены:

source: Components to remove:
ru: Следующие компоненты будут удалены:

source: Failed to print affected components for %s of component %s. Failed to make pretty output.
ru: Не удалось распечатать затронутые компоненты при %s компонента %s. Не удалось отформатировать вывод.

source: The following components will also be installed:
ru: Также будут установлены следующие компоненты:

source: The following components will also be removed:
ru: Также будут удалены следующие компоненты:

source: Internal error in components module - AlteratorCtlComponentsModule *module is NULL in components_module_get_base_section_packages.
ru: Внутренняя ошибка в модуле components - AlteratorCtlComponentsModule *module равен NULL в components_module_get_base_section_packages.

source: Failed to get base components packages. Failed to get base components list.
ru: Не удалось получить список пакетов, относящихся к базовым компонентам.

source: Failed to get base components packages. Failed to get base component name.
ru: Не удалось получить список пакетов компонента. Не удалось получить имя базового компонента.

source: Can't get component %s packages. Getting base components packages list failed.
ru: Невозможно получить список пакетов компонента %s. Не удалось получить список базовых компонентов.

source: Internal error in get_editions_module: unvaliable id of editions module.
ru: Ошибка при исполнении get_editions_module: недействительный id модуля editions.

source: The call to the editions description method failed. The module doesn't exist.
ru: Вызов метода editions description завершился неудачей. Модуль не существует.

source: Fail to check existance of edition "%s"
ru: Не удалось проверить существование редакции "%s".

source: Fail to check existance of unspecified edition.
ru: Нельзя проверить существование неуказанной редакции "%s".

source: Edition "%s" object not defined on D-Bus.
ru: Объекта редакции "%s" не существует на D-Bus.

source: The current edition doesn't exist.
ru: Текущая редакция не устанолена.

source: Can't allocate dbus_ctx_t in editions_module_description_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде editions_module_description_subcommand

source: The call to the editions license method failed. The module doesn't exist.
ru: Вызов метода editions license завершился неудачей. Модуль не существует.

source: Can't allocate dbus_ctx_t in editions_module_license_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде editions_module_license_subcommand

source: Internal error in editions module - AlteratorCtlEditionsModule *module is NULL in "editions list".
ru: Внутренняя ошибка в модуле editions - AlteratorCtlEditionsModule *module равен NULL при исполнении команды "editions list".

source: Editions list is empty.
ru: Список редакций пуст.

source: The call to the editions info method failed. The module doesn't exist.
ru: Вызов метода editions info завершился неудачей. Модуль не существует.

source: Can't allocate dbus_ctx_t in editions_module_info_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде editions_module_info_subcommand

source: Current edition is not set.
ru: Текущая редакция не установлена.

source: Internal error in editions module - AlteratorCtlEditionsModule *module is NULL in "editions set".
ru: Внутренняя ошибка в модуле editions - AlteratorCtlEditionsModule *module равен NULL при исполнении команды "editions set".

source: Internal error in editions module: edition_str_id is NULL.
ru: Внутренняя ошибка в модуле editions: edition_str_id равен NULL.

source: Can't allocate dbus_ctx_t in editions_module_set_current_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде editions_module_set_current_subcommand

source: Can't set a non-existent edition.
ru: Невозможно выбрать несуществующую редакцию.

source: Internal error in editions module - AlteratorCtlEditionsModule *module is NULL in "editions get".
ru: Внутренняя ошибка в модуле editions - AlteratorCtlEditionsModule *module равен NULL при исполнении команды "editions get".

source: Can't allocate dbus_ctx_t in editions_module_get_current_subcommand
ru: Невозможно выделить dbus_ctx_t в подкоманде editions_module_get_current_subcommand

source: Internal error in editions module run: *module is NULL.
ru: Внутренняя ошибка в модуле editions при исполнении editions_module_run - *module равен NULL.

source: Internal error in editions module run: *context is NULL.
ru: Внутренняя ошибка в модуле editions при исполнении editions_module_run - *context равен NULL.

source: Try to run unknown editions subcommand.
ru: Попытка запуска модуля editions с неизвестными командами.

source: Internal error in editions module when handle result: module is NULL.
ru: Внутренняя ошибка обработки результата в модуле editions: *module равен NULL.

source: Internal error in editions module when handle results: *ctx is NULL.
ru: Внутренняя ошибка обработки результата в модуле editions. *ctx равен NULL.

source: Edition description is empty.
ru: Описание редакции отсутствует.

source: Wrong answer type in edition description.
ru: Неправильный тип данных в модуле editions после вызова метода description.

source: Handling of edition description failed: no return code.
ru: Невозможно получить описание редакции: код возврата отсутствует.

source: Current edition license is empty.
ru: Лицензия текущей редакции пуста.

source: Wrong answer type in edition license.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды editions license.

source: Handling of edition license failed: empty exit code.
ru: Невозможно получить лицензию редакции: нет данных о коде возврата.

source: D-Bus error in components info.
ru: Ошибка D-Bus при исполнении команды components info.

source: Can't get editions info result: exit code is empty.
ru: Не получилось получить информацию о редакции: нет данных о коде возврата.

source: D-Bus error in editions set handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата editions set: невозможно получить результат.

source: Wrong answer type in editions set.
ru: Неизвестный возвращаемый тип данных после исполнения подкоманды editions set.

source: Error while running Current() method in %s: exit_code is NULL.
ru: Ошибка DBus во время работы метода Current() в %s: код возврата равен NULL.

source: Editions set failed: exit code is %i.
ru: Editions set закончился неудачей: код возврата %i.

source: D-Bus error in editions get handle result: failed to produce a result.
ru: Ошибка D-Bus при обработке результата editions get: невозможно получить результат.
